{
  "doc-e4382255d3faebbabad7e5a8962faf68": {
    "content": "RESEARCH\r\n\r\n\r\n\r\n\r\nIndustry Cyber Exposure\r\nReport (ICER): Nikkei 225\r\n\r\n\r\n\r\n\r\n©RAPID7 2021\r\n\fTABLE OF CONTENTS\r\n\r\n\r\n\r\n\r\nExecutive Summary                                                                                       4\r\n   Key Takeaways                                                                                         5\r\n\r\n\r\nEmail Security Among The Nikkei 225                                                                     6\r\n   Results                                                                                               8\r\n   By Industry                                                                                           9\r\n   CISO Takeaways                                                                                        9\r\n\r\n\r\nWeb Service Security Among the Nikkei 225                                                           10\r\n   HTTPS Support                                                                                        11\r\n   HSTS Adoption                                                                                        12\r\n   Summary                                                                                              13\r\n\r\n   CISO Takeaways                                                                                       13\r\n\r\n\r\nVersion Complexity Among the Nikkei 225                                                             14\r\n   Version Dispersion Among Web Servers                                                                 16\r\n   Version Dispersion: Focus on Microsoft Exchange                                                      17\r\n   CISO Takeaways                                                                                       18\r\n\r\n\r\nHigh-Risk Services Among the Nikkei 225                                                             22\r\n   Findings: RDP, SMB, and Telnet                                                                       24\r\n   Windows Remote Desktop Protocol (RDP)                                                                24\r\n   Windows Server Message Block (SMB)                                                                   25\r\n   Telnet                                                                                               27\r\n   Exposure Overview                                                                                    28\r\n  CISO Takeaways                                                                                        29\r\n\r\n\r\n\r\n\r\n                                                     Industry Cyber-Exposure Report (ICER): Nikei 225    2\r\n\fTABLE OF CONTENTS\r\n\r\n\r\n\r\n\r\nVulnerability Disclosure Programs Among the Nikkei 225                                   30\r\n   Results: Prevalence of VDP Adoption                                                       32\r\n   CISO Takeaways                                                                            33\r\n\r\n\r\nConclusion                                                                               35\r\n   CISO Actions at a Glance                                                                  36\r\n\r\n\r\nAppendix: Prioritization in Times of Crisis                                              38\r\n\r\n\r\n\r\n\r\n                                          Industry Cyber-Exposure Report (ICER): Nikei 225    3\r\n\fExecutive Summary\r\nAs the world’s knowledge workers were driven home amid a pandemic and cases of ransomware ran rampant\r\nacross the internet, measuring the world’s most critical businesses’ internet exposure has become more import-\r\nant than ever. In this round of Internet Cyber-Exposure Reports (ICERs), researchers at Rapid7 evaluate 5 areas\r\nof cybersecurity that are both critical to secure to continue doing business on and across the internet, and are\r\nsquarely in the power of CISOs, their IT security staffs, and their internal business partners to address.\r\n\r\n\r\n\r\nThese five facets of internet-facing cyber-exposure and risk include:\r\n\r\n    1. Authenticated email origination and handling (DMARC)\r\n    2. Encryption standards for public web applications (HTTPS & HSTS)\r\n    3. Version management for web servers and email servers (focusing\r\n    on IIS, nginx, Apache, and Exchange)\r\n    4. Risky protocols unsuitable for the internet (RDP, SMB, and Telnet)\r\n    5. The proliferation of vulnerability disclosure programs (VDPs)\r\n\r\nIn this report, we examine the internet-facing cyber-exposure of the top companies listed on Japan’s Nikkei 2251.\r\nEach section is accompanied by real-world, practical advice that practitioners can start implementing today.\r\nNote that this advice is not only for those CISOs who are privileged to hold positions in Nikkei 225 companies,\r\nbut also for those security experts who find themselves in business and regulatory relationships with members\r\nof this prestigious collection of corporations.\r\n\r\n\r\nThrough the first half of 2021, Rapid7 will be releasing reports measuring these five critical areas of\r\ncybersecurity fundamentals across five of the most advanced economies of the world:\r\n\r\n    1. The United States Fortune 5002\r\n    2. The United Kingdom’s FTSE 3503\r\n    3. Australia’s ASX 2004\r\n    4. Germany’s Deutsche Börse Prime Standard 3145\r\n    5. Japan’s Nikkei 225 (this report)\r\n\r\n\r\n\r\n\r\n1\r\n  https://indexes.nikkei.co.jp/en/nkave/index?type=index\r\n2\r\n  https://www.rapid7.com/research/report/2021-industry-cyber-exposure-report/\r\n3\r\n  https://www.rapid7.com/research/reports/2021-industry-cyber-exposure-report-uk\r\n4\r\n  https://www.rapid7.com/research/report/2021-industry-cyber-exposure-report-anz/\r\n5\r\n  https://www.rapid7.com/research/report/icer-germany-2021/\r\n\r\n\r\n\r\n                                                                                Industry Cyber-Exposure Report (ICER): Nikei 225   4\r\n\fKey Takeaways\r\nThe paper is divided into five detailed sections covering the areas mentioned above, and the overall takeaways\r\nof this research are as follows:\r\n\r\n     •   Nikkei 225 email security posture is lagging behind the US and UK. At the beginning of 2021, email\r\n         security among the Nikkei 225 isn’t keeping pace with its peers in the US and UK. While DMARC\r\n         adoption in the US and UK hovers around 50%, only about 13% of all the surveyed companies op-\r\n         erating in Japan have any DMARC records configured, and of those, 25 out of 29 (about 86%) are\r\n         set with a p=none (or passthrough) policy. In other words, only 4 (under 2%) of the Nikkei 225-listed\r\n         companies are taking active measures to protect their brands, employees, and customers through\r\n         DMARC p=quarantine or p=reject policies.\r\n\r\n\r\n     •   Exposed, dangerous services are less of a concern in Japan. While dangerous protocol exposures of\r\n         Windows Remote Desktop (RDP) file-sharing (SMB), and Telnet continue to be an issue across the\r\n         surveyed companies, it does not appear to be nearly as much of a problem as we’ve seen among\r\n         the U.S.-based Fortune 500: For RDP and SMB, over 90% of the Nikkei 225 had no exposure.\r\n\r\n\r\n     •   Telnet and HSTS remain concerning, however. Telnet is a different story; about 27% of the Nikkei\r\n         225 has some legacy telnet exposed to the internet. Additionally, when we looked at secure HTTP\r\n         (HTTPS) deployment, we found that while HTTPS is standard for 100% of the Nikkei 225 companies,\r\n         very few listed companies (18%) have implemented HSTS directives to ensure that HTTPS infrastruc-\r\n         ture is actually being used all the time.\r\n\r\n\r\n     •   Version dispersion is on the right track in Japan. Only 16 companies in the Nikkei are running their\r\n         own Exchange servers (rather than managed cloud instances), and of these, about 75% are running\r\n         at least 1 instance of the latest supported version. That said, we did count 93 distinct versions of\r\n         Apache, 75 distinct versions of Nginx, and 17 distinct versions of IIS in the Nikkei 225.\r\n\r\n\r\n     •   The Japanese Technology sector stands alone in vulnerability disclosure. Nearly all of the 16 VDPs\r\n         we found across the 225 surveyed companies are either in the Technology sector proper, or in tech-\r\n         heavy Consumer Goods companies. So, while this is pretty good for Japanese tech, it’s not great for\r\n         the rest of the Japanese businesses that have not normalized VDPs for their products and infra-\r\n         structure.\r\n\r\n\r\nWith these key findings in mind, the remainder of this report explores each of the 5 areas of cybersecurity mea-\r\nsurable in the Nikkei 225.\r\n\r\n\r\nBefore you dive in, we want to note that if your organization was and/or still is impacted by those events, you\r\nmay be feeling like you are spending most of your time and energy dealing with emergencies rather than being\r\nable to focus on some of the more chronic issues outlined in this report. Since our goal is to help organizations\r\nbecome (and remain) safe and resilient, we have an appendix just for you. Consider jumping there first before\r\ntackling the sections below.\r\n\r\n\r\n\r\n                                                                      Industry Cyber-Exposure Report (ICER): Nikei 225   5\r\n\fEmail Security Among\r\nthe Nikkei 225\r\n\fWe all know and love—or at least begrudgingly rely upon—email. It is a pillar of modern communications,\r\nbut is unfortunately also highly susceptible to being leveraged as a mechanism for malicious actions, such as\r\nspoofing or phishing.\r\n\r\n\r\nA core concern regarding email is the authenticity of the source, and in recent years, DMARC has arisen as\r\nthe preeminent email validation system. DMARC builds upon the foundations of 2 older email authentication\r\nsystems: Sender Policy Framework (SPF) and DomainKeys Identified Mail (DKIM), which respectively check\r\nfor mail-server authorization (“Is the sender authorized?”) and email integrity based on key signatures (“Was\r\nthe content altered?”). The various components of DMARC can serve to mitigate direct threats as well as po-\r\ntential reputational damage, such as spoofed emails intended to mislead partners, suppliers, or customers.\r\n\r\n\r\nA properly implemented DMARC system can identify illegitimate emails and define how they should be han-\r\ndled. DMARC can be configured to handle emails of suspect provenance with different degrees of severity,\r\ndepending on the aggressiveness of IT administrators. The DMARC policy options include:\r\n\r\n      None, where suspect emails are reported to a designated email address that serves to monitor DMARC\r\n      notifications.\r\n\r\n      Quarantine, where suspect emails are punted to the spam folder and a report of its receipt is delivered\r\n      to the monitoring email address.\r\n\r\n      Reject, where in addition to notifying the monitoring email address, suspect emails are not delivered at\r\n      all.\r\n\r\n\r\nBy virtue of its efficacy in mitigating malicious messaging via email, we consider DMARC a significant risk\r\nmitigator and highly recommend its implementation. Unfortunately, while the benefits of DMARC are\r\nprofound, its implementation is not global. DMARC’s implementations are tracked in public Domain Name\r\nSystem (DNS) records. To determine whether an organization utilizes DMARC only requires the examination\r\nof the organization’s published DMARC record. We are able to discern the scale and types of DMARC imple-\r\nmentations by comparing the primary, well-known domains of the Nikkei organizations against their corre-\r\nsponding DMARC records that appear alongside DNS.\r\n\r\n\r\nNote that for the scope of this study, we focus primarily on the apex domains of organizations, and do not\r\nexplore additional domains owned by particular organizations. We elected this approach because there can\r\nbe significant variation in domain set ownership by organization. By focusing on apex domains, we are in\r\neffect treating it as a bellwether indicator of an organization’s overall email security posture. After all, if an\r\norganization fails to implement DMARC on a primary domain, how confident should we be that the organi-\r\nzation practices healthy email hygiene across far less-prominent domains?\r\n\r\n\r\nThese published DMARC records are intended to be highly accessible. They are the means through which\r\nemail recipients determine how to validate emails using DMARC, what email address to notify when receiv-\r\ning emails that fail DMARC validation, and what DMARC policy to apply in handling invalid emails.\r\n\r\n\r\n\r\n\r\n                                                                        Industry Cyber-Exposure Report (ICER): Nikei 225   7\r\n\fResults\r\nWe found that 29 (or approximately 13%) of the Nikkei 225 set of organizations had implementations of DMARC\r\nfor their primary domains, all of which were validly formatted. Of the set of national indexes that we have exam-\r\nined so far in the ICER series, this is a remarkably low level of DMARC coverage in comparison.\r\n\r\n\r\n\r\n\r\n      2020: Nikkei 225 DMARC Coverage\r\n      All instances of DMARC policies found were properly formed and valid.\r\n\r\n\r\n\r\n                                                         No Valid Policy                                                                 Valid\r\n                                                           196 (87%)                                                                   29 (13%)\r\n\r\n\r\n                                                                                                                                      Updated May 2021\r\n\r\n\r\n\r\nFigure 1: 2020 Nikkei DMARC Coverage\r\n\r\n\r\n\r\n\r\nWhen we examine the DMARC policies in a bit more detail, we find that most valid DMARC policies are set to\r\n“none”, or simply to monitor and inform, followed by “reject”, which is the most aggressive approach. The least\r\nprominent policy implementation is “quarantine”, a policy to isolate suspect emails. That being said, the num-\r\nbers are all fairly small, so attempts to draw any sort of pattern would be meaningless.\r\n\r\n\r\nSomewhat disheartening is the lack of any DMARC implementations across all other industries to some extent.\r\n                         2020: Nikkei 225 DMARC Policies\r\n                         All instances of DMARC policies found were properly formed and valid.\r\n\r\n\r\n\r\n\r\n                        No valid policy - 87.11% (196)       none - 11.11% (25)   quarantine - 0.44% (1)         reject - 1.33% (3)\r\n\r\n                                                                                                           Updated May 2021\r\nFigure 2: 2020 Nikkei DMARC Polices\r\n\r\n\r\n\r\n\r\n                                                                                        Industry Cyber-Exposure Report (ICER): Nikei 225                 8\r\n\fBy Industry\r\nWe can also separate the organizations by industry to get a better sense of DMARC variations across the sec-\r\ntors. The most prominently featured industries in the Nikkei 225 include technology and materials.\r\n\r\n\r\n\r\n    2020: Nikkei 225 DMARC Policies for Apex Domains\r\n    n is the count of distinct organisations by sector. Sectors are organized by n.\r\n\r\n                                               none                         quarantine                         reject                           No valid policy\r\n\r\n\r\n                       Technology (n = 58)\r\n\r\n\r\n\r\n\r\n                         Materials (n = 58)\r\n\r\n\r\n\r\n\r\n             Capital Goods/Others (n = 35)\r\n\r\n\r\n\r\n\r\n                 Consumer Goods (n = 33)\r\n\r\n\r\n\r\n\r\n                        Financials (n = 21)\r\n\r\n\r\n\r\n\r\n       Transportation and Utilities (n = 20)\r\n\r\n\r\n                                               0   10   20   30   40   50   0   10   20     30   40   50       0   10   20   30   40       50   0   10   20   30   40    50\r\n                                                                                                                                                                        Count\r\n\r\n\r\n                                                                                     none        quarantine   reject     No valid policy\r\n\r\n                                                                                                                                                          Updated: May 2021\r\n\r\n\r\n\r\n\r\nFigure 3: 2020 Nikkei DMARC Polices for Apex Domains\r\n\r\n\r\n\r\n\r\nCISO Takeaways\r\nIf DMARC has not already been implemented in your organization, take proactive measures to get it set up.\r\n\r\n\r\nNowadays, DMARC can be thought of as a foundational fixture of email hygiene, and it broadly signals an orga-\r\nnization’s commitment to modern information security norms. Furthermore, lacking a DMARC implementation\r\nleaves an organization potentially blind to malicious email campaigns that are not captured through some form\r\nof DMARC monitoring that can be informative in terms of scale, source, and severity.\r\n\r\n\r\nOnce the decision has been made to implement DMARC, it’s time to consider the policy implementation in a\r\nmore nuanced manner. An aggressive reject policy is highly secure but might result in legitimate emails being\r\nblocked. A more forgiving quarantine policy could strike a balance between preventing aggravation and allow-\r\ning for some form of recourse. At the very minimum, a DMARC implementation of some form should be in place\r\nto monitor for illegitimate or poorly configured email traffic.\r\n\r\n\r\n\r\n\r\n                                                                                                              Industry Cyber-Exposure Report (ICER): Nikei 225                  9\r\n\fWeb Service Security\r\nAmong the Nikkei 225\r\n\fThe vast majority of the interactions an average person has with technology is through some form of a web\r\napplication, but what constitutes a “web app” can be considered quite nebulous, and the security controls for\r\nhardening these applications are equally broad. APIs, distributed authentication schemes, single-page appli-\r\ncations, and static websites all might fall under the general category of “web application.” There are very few\r\nsecurity measures that should be applied to all web applications across the board without further subdividing\r\nwhat specific type of application we are referring to. However, there are a couple that we will examine here.\r\n\r\n\r\nAll web applications should require strong encryption, with a vanishingly small number of exceptions. While\r\nthis is most critical for applications serving up critical or sensitive information, such as personally identifiable\r\ninformation (PII), it is important even if you serve only static informational content. There is a common miscon-\r\nception that the only risk of using an insecure connection is a loss of confidentiality—that the information a\r\nuser is browsing could be observed by a malicious third party. While this certainly is a risk, it is often overlooked\r\nthat a lack of encryption makes the connection vulnerable to modification (a loss of integrity). This means that\r\nmalicious third parties could not only observe potentially confidential information, but that they could alter that\r\ninformation or inject their own content that could potentially compromise your users.\r\n\r\n\r\nThe risk of malicious content injection exists regardless of whether your web application serves sensitive infor-\r\nmation or just cute pictures of cats6. Due to this universal risk to a site’s users and to the overarching brand\r\nreputation of the site owner, we will consider the support of strong encryption (in our case, TLS) and the en-\r\nforcement of its usage via HTTP Strict Transport Security (HSTS). For the purposes of this section, we will look\r\nat the primary domain for each company, as it is the domain that is most responsible for a company’s brand\r\nreputation.\r\n\r\n\r\n\r\nHTTPS Support\r\nHTTPS is the protocol that ensures web traffic is encrypted and secure. There are a few ways that HTTPS could\r\nbe configured in an environment.\r\n\r\n          Not available (HTTP only)\r\n\r\n          Available and optional\r\n\r\n          Required (HTTP “Strict Transport Security”, or HSTS, configured)\r\n\r\n          Required with HSTS preloading\r\n\r\n\r\nSupporting HTTPS for your site is table stakes for having a web presence at all, with requiring encryption follow-\r\ning very closely behind. HSTS preloading does carry some technological challenges, but they are challenges that\r\na web security program should be working to proactively address.\r\n\r\n\r\nWith all this said, let’s share some good news right off the bat: Among the sites we examined in the Nikkei 225,\r\n100% of them supported HTTPS.\r\n\r\n\r\n\r\n6\r\n    https://www.sanrio.co.jp/\r\n\r\n\r\n                                                                     Industry Cyber-Exposure Report (ICER): Fortune 500   11\r\n\fHSTS Adoption\r\nThe outlook for HSTS adoption was unfortunately a bit grim.\r\n\r\n\r\nAs you can see, only about 18% of the sites examined supported HSTS at all. This is substantially less than what\r\nwe have observed in other reports. If the site already fully supports HTTPS (and these sites all do), it should be\r\nrelatively simple to implement HSTS to guarantee your users visit the secure version of your site. Most of these\r\nsites do provide a redirect from the insecure version of their homepage—however, that will not mitigate a man-\r\nin-the-middle (MiTM) attack.\r\n\r\n\r\n            2020: Nikkei 225 HSTS Policy\r\n            Percentage calculated based on the total set of domains (225)\r\n\r\n\r\n\r\n\r\n                                          No HSTS Policy - 184 (81.78%)\r\n                                          HSTS Enabled & Preload Enabled & Include Subdomains Enabled - 5 (2.22%)\r\n                                          HSTS Enabled & Include Subdomains Enabled - 6 (2.67%)\r\n                                          HSTS Enabled & Preload Enabled - 2 (0.89%)\r\n                                          HSTS Enabled - 28 (12.44%)\r\n\r\n\r\nFigure 4: 2020 Nikkei 225 HSTS Policy\r\n\r\n\r\nNone of the observed domains have HSTS manually disabled. The percentage of domains with this configuration\r\ntends to be low, so this observation is likely due to the low total number of HSTS supporting domains in this list.\r\n27% of sites that support HSTS also support the “includeSubDomains” directive, protecting the entire domain\r\nand all subdomains. This is a fantastic security feature, but it can be difficult to implement in certain situations.\r\n\r\n\r\n17% of sites with HSTS also support the “preload” directive. This directive will cause crawlers to automatically\r\nadd your site to a global list of known sites that support HSTS. If a supporting browser is directed to a site with\r\nHSTS preload enabled, it will guarantee that the first connection is always conducted over HTTPS, meaning it\r\neliminates the one, single place where your site’s users are vulnerable to MiTM attacks—the first connection to\r\nyour site before an HSTS header has ever been encountered. This configuration option is a simple way to add an\r\nextra layer of protection for your users, and if you bother to enable HSTS, you should certainly add this option.\r\nWhile it’s a somewhat newer directive with less browser support, there is no downside to including it (browsers\r\nthat do not support HSTS will simply ignore it).\r\n\r\n\r\n\r\n                                                                                               Industry Cyber-Exposure Report (ICER): Nikei 225 12\r\n\fSummary\r\nSecuring and encrypting traffic to your user-facing domains is not only good practice, but it also protects your\r\ncorporate brand. Securing HTTP with TLS has been a major point of focus for the web-security community for\r\nthe past several years, and for good reason. All of the Nikkei 225 companies provided a secure version of their\r\nprimary website, but they have a long way to go before they come up to snuff in terms of best practices.\r\n\r\n\r\nThe especially poor adoption of HSTS across the Nikkei 225 could be an indicator that their application security\r\nprogrammes are falling behind, especially since other, more sophisticated, mitigations can be significantly more\r\ncomplicated to implement. While the standards certainly move quickly, it’s important to keep up to speed, espe-\r\ncially when your brand reputation is on the line.\r\n\r\n\r\n\r\nCISO Takeaways\r\nIf you haven’t thought about your site’s encryption for a while, now might be the time to revisit it. A compa-\r\nny’s brand reputation is on the line when consumer-facing web applications suffer from security failures, and\r\nit’s important to consider this fact when making investment decisions in various security programmes.\r\n\r\n\r\nIf your company’s website is not supporting HSTS, it might be worthwhile to find out why. Is it a technical,\r\norganizational, or budgetary constraint? Finding the cause could be a great springboard for re-evaluating\r\nyour entire application security program.\r\n\r\n\r\n\r\n\r\n                                                                     Industry Cyber-Exposure Report (ICER): Nikei 225 13\r\n\fVersion Complexity\r\nAmong the Nikkei 225\r\n\fComplexity is the enemy when it comes to successful security outcomes in an organization. Diversity in sys-\r\ntems, technologies, and business processes present real, daily challenges for even the most mature security\r\nteams, especially when it comes to patch and vulnerability management.\r\n\r\n\r\nPatching even 1 major vulnerability can be a Herculean task in many places. Diversity compounds complex-\r\nity within each technology component. That is to say, an organization may have many different web server\r\ntechnologies in use. Each technology, in turn, may have its own hodgepodge of versions, which directly (neg-\r\natively) impacts configuration management and patch management.\r\n\r\n\r\nTo get a feel for how these well-resourced organizations are performing in this area, we looked at 3 separate\r\nfactors:\r\n\r\n     1. The diversity of the portfolio of a selected technology—web servers—in use by each organization\r\n     2. How well maintained this portfolio is\r\n     3. How well organizations maintain critical services, such as email gateways\r\n\r\n\r\nOur findings show that:\r\n\r\n     •     Within a single technology stack (web servers), organizations in some key industries—Capital Goods/\r\n           Others, Consumer Goods, Technology, and Transportation and Utilities—expose 9 or more different\r\n           versions of Apache and/or Nginx. Capital Goods/Others, Consumer Goods, Financials, Materials, Tech-\r\n           nology, and Transportation and Utilities have 1 or more members exposing 3 or more different versions\r\n           of IIS. This increases their respective attack surfaces and makes it difficult to deploy patches (when\r\n           they bother to apply patches) due to testing and quality assurance complexity.\r\n\r\n\r\n     •     Some organizations have serious difficulty keeping critical IT infrastructure—such as Microsoft Ex-\r\n           change—current. Impressively, around 75% (12 out of 16) of Nikkei 225 that still run self-hosted Mic-\r\n           rosoft Exchange are running at least 1 current/supported version of Exchange. On the flip side, about\r\n           56% (9 out of 16) are running at least one end-of-life version of Exchange 2010, putting them at risk of\r\n           future vulnerability exploitation.7\r\n\r\n\r\nWe used Project Sonar8 and Recog9 to identify internet-facing technologies—e.g., web servers, file servers,\r\nDNS, SSH, etc.—that were in use for each organization in the Nikkei 225. We then mapped them to available\r\nCommon Platform Enumeration10 (CPE) strings. This methodology has some limitations in that the results are\r\nconstrained by:\r\n\r\n     •     The fingerprints available to Recog\r\n     •     How promiscuous each fingerprintable service is (i.e., whether Recog can extract version information)\r\n\r\n\r\n\r\n7\r\n  This adds up to over 100%, because it’s possible to run both a current and EOL’ed Exchange installation in the same organization.\r\n8\r\n  https://www.rapid7.com/research/project-sonar\r\n9\r\n  https://github.com/rapid7/recog\r\n10\r\n   Common Platform Enumeration definition and database: https://nvd.nist.gov/products/cpe\r\n\r\n\r\n\r\n                                                                                   Industry Cyber-Exposure Report (ICER): Nikei 225 15\r\n\f      •       The ports and protocols Project Sonar studies\r\n      •       Our measurement of only IPv4-space\r\n      •       Sonar honouring IPv4 opt-out requests\r\n\r\nThese constraints, if anything, generally result in underreporting of the magnitude of the findings.\r\n\r\n\r\nVersion Dispersion Among Web Servers\r\nBack in 2018, when we began our first foray into analysing the cyber-exposure of the Nikkei 225, we created the\r\nterm “version dispersion” to refer to the diversity of versions within a service component an individual organiza-\r\ntion was exposing to the internet. With the dramatic rise11 in enterprise use of tooling such as Kubernetes12, we\r\nexpected to see a reduction in version dispersion of the 3 web servers—IIS, Apache, and Nginx—that we\r\npreviously measured.\r\n\r\n\r\nThere are at least more than 93 distinct versions of Apache, 75 distinct versions of Nginx13, and 17—yes, 17—\r\nversions of IIS14 running across the entire set of Nikkei 225 members. Let’s see how that stacks up by industry.\r\n\r\n\r\n\r\n     Web Server Version Dispersion in 2021 Nikkei 225 Members\r\n     Each dot is one organisation. Placement on the X-axis denotes how many different versions are in-use by a single organisation\r\n\r\n                                                Apache                        IIS                                         Nginx\r\n                                                0    20   40   60   80       0       20      40      60       80         0        20         40         60         80\r\n\r\n               Capital Goods/Others (n=27)\r\n\r\n\r\n                    Consumer Goods (n=20)\r\n\r\n\r\n                             Financials (n=7)\r\n\r\n\r\n                            Materials (n=30)\r\n\r\n\r\n                         Technology (n=40)\r\n\r\n\r\n          Transportation and Utilities (n=10)\r\n\r\n                                                0    20   40   60   80       0       20      40      60       80         0        20        40          60          80\r\n                                                                                                                                   # of web server versions identiﬁed\r\n\r\n\r\n\r\n\r\nFigure 5: Web Server Version Dispersion in 2021 Nikkei 225 Members\r\n\r\n\r\n\r\nA higher density of points toward “1” on the X-axis means that each of the organizations those points represent\r\nare running with a low version dispersion. This means they have better control over server/service deployments\r\nand configurations, have fewer versions to test patches against, and can make changes faster and with more\r\nconfidence than others. It also likely means they have a more rigorous “you must be this tall to deploy a server\r\non the internet” rules than organizations that are further to the right on the X-axis.\r\n\r\n\r\n\r\n\r\n11\r\n   A Cloud Native Computing Foundation 2019 survey notes 78% of respondents are using Kubernetes in production, a huge jump\r\nfrom 58% in 2018\r\n12\r\n   Kubernetes main site: https://kubernetes.io\r\n13\r\n   Some organizations announce they use a particular server type but redact the discrete version number.\r\n14\r\n   We frequently see leaking of IIS build strings in announced Server header banners in IIS deployments.\r\n\r\n\r\n                                                                                                  Industry Cyber-Exposure Report (ICER): Nikei 225 16\r\n\fAttackers and cyber-insurance assessors alike notice such things and may be more likely to target organizations\r\nthat exhibit a more “wild, wild west” stature. There is a striking difference between web server version disper-\r\nsion in the Nikkei 225 vs what we’ve reported in the FTSE 350 and Fortune 500 ICERs. One reason for this is that\r\ncompanies listed in the Nikkei seem to have a preference for “the cloud,” possibly to ensure faster global con-\r\nnectivity to the information or services provided by the web services they expose. We do not measure “cloud”\r\nassets in the ICERs, so these positive results come with said additional caveat.\r\n\r\n\r\n\r\nVersion Dispersion: Focus on Microsoft Exchange\r\nSome internet-facing services are more important than others. It’s one thing to have a crusty old Apache HTTPD\r\nserver attached to the internet, which may only have a denial-of-service weakness. It is quite another thing to\r\nrun old versions of what most organizations would (or should) deem critical infrastructure, such as Microsoft\r\nExchange servers or VPN/gateway/remote-access services.\r\n\r\n\r\nTo get a feel for how well these organizations maintain critical services, we’ll take a peek at Microsoft Exchange\r\nhygiene. Unlike their Fortune 500 counterparts, only 6% of Nikkei 225 organizations still15 have at least 1 inter-\r\nnet-facing Exchange server handling business-critical email, and Exchange has had a fair number of weakness-\r\nes—of varying criticality—uncovered over the years:\r\n\r\n\r\n\r\n\r\n                   Exchange CVEs by Type\r\n              35\r\n     # CVEs\r\n\r\n\r\n\r\n\r\n              30\r\n\r\n\r\n              25\r\n\r\n\r\n              20\r\n\r\n\r\n              15\r\n\r\n\r\n              10\r\n\r\n\r\n              5\r\n\r\n\r\n              0\r\n                     XSS   DoS      Overﬂow       Code        Info     Memory      Barrier      Gain       Directory   CSRF\r\n                                                Execution    Leak     Corruption   Bypass     Privileges   Traversal\r\nFigure 6: Exchange CVEs by Type\r\n\r\n\r\n\r\n16 organizations (excluding 2 ISPs that allow general service hosting) have chosen to go it on their own\r\nwhen it comes to email hosting, so surely they know the dangers facing self-hosted Exchange and take care\r\nto ensure this vital service is at peak resiliency, at least when it comes to security patches. Right?\r\n\r\n\r\n\r\n\r\n15\r\n   Microsoft 365/Office 365 adoption continues to grow at a significant clip, with 70% of the Fortune 500 using one or more services,\r\nincluding hosted Exchange. Source: https://www.thexyz.com/blog/microsoft-office-365-usage-statistics/\r\n\r\n\r\n                                                                                    Industry Cyber-Exposure Report (ICER): Nikei 225 17\r\n\f                      Exchange Server Age/Up-to-Date Status of the Nikkei 225\r\n                 40\r\n     # Servers\r\n\r\n\r\n\r\n\r\n                 30\r\n\r\n\r\n                                                                      Latest Version          Older Version\r\n\r\n                 20\r\n\r\n\r\n\r\n\r\n                 10\r\n\r\n\r\n\r\n\r\n                 0\r\n                           Jan    Jan    Jan      Jan        Jan       Jan              Jan           Jan            Jan           Jan           Jan\r\n                          2011   2012   2013     2014       2015      2016             2017          2018           2019          2020          2021\r\n                                                                                                              Discovered Exchange Server Release Date\r\n\r\n\r\n\r\nFigure 8: Exchange Server Age/Up-to-date Status of the Nikkei 225\r\n\r\n\r\nThe above figure paints a fairly disturbing picture of the state of Microsoft Exchange in the Nikkei 225 in both\r\ncurrency (i.e., age of some server versions) and whether the deployed version is supported16 by standard Micro-\r\nsoft support contracts17. On the plus side, just over 50% of discovered, precise-version fingerprinted instances\r\nare 2020/2021 releases.\r\n\r\n\r\nWe were hoping to see a repeat of our ASX 200 ICER findings with zero presence of Exchange 2007 (which has\r\nbeen at end-of-life status for a while). Sadly, our hopes were crushed as we spotted a single instance at a major\r\nTechnology company. Additionally, a few handfuls of the Nikkei 225 did not seem to get the memo18 about Ex-\r\nchange 2010 reaching end-of-life status in October 2020.\r\n\r\n\r\n\r\n\r\n16\r\n   https://docs.microsoft.com/en-us/exchange/new-features/build-numbers-and-release-dates\r\n17\r\n   This does not take into account the fact that an organization may have a custom or extended support agreement with Microsoft,\r\nthough that matters little when it comes to vulnerability exploitation.\r\n18\r\n   https://docs.microsoft.com/en-us/microsoft-365/enterprise/exchange-2010-end-of-support?view=o365-worldwide\r\n\r\n\r\n                                                                                       Industry Cyber-Exposure Report (ICER): Nikei 225 18\r\n\f          Nikkei 225 Exchange Server Distribution by Major Version\r\n\r\n     30\r\n\r\n\r\n\r\n\r\n     20\r\n\r\n\r\n\r\n\r\n     10\r\n\r\n\r\n\r\n\r\n      0\r\n                                                 2007                                2010                 2013             2016                   2019\r\n\r\n\r\n\r\n\r\nFigure 9: Nikkei 225 Exchange Server Distribution Major Version\r\n\r\n\r\nIf your organization is struggling to keep up with Exchange patching, you may have a bit of wiggle room\r\nwhen it comes to excuses since Microsoft does keep you busy, as seen in the volume of in-year updates for\r\nat least modern versions of Exchange:\r\n\r\n\r\n\r\n                                                      Exchange Server Releases Per Year\r\n                                                      Position of each label on the X axis shows how many releases the associated version of\r\n                                                      Microsoft Exchange had that year. 2021 has been brutal on already overwhelmed IT teams.\r\n                                                                                                                                     In-Year Release Count\r\n                                                  0                                  5                   10           15                      20\r\n               Exchange Major Version Number\r\n\r\n\r\n\r\n\r\n                                                                                    2019\r\n                                               2019     2021\r\n                                                                                    2018                                                          2020\r\n\r\n\r\n\r\n                                                                             2017                                                 2020\r\n                                                                                    2016\r\n                                               2016            2015\r\n                                                                      2018          2021\r\n                                                                             2019\r\n\r\n\r\n                                                                           2016\r\n                                                                      2013 2014\r\n                                               2013     2012 2018\r\n                                                                      2019 2015\r\n                                                                           2017\r\n\r\n                                                                           2016\r\n                                                                      2019 2014\r\n                                               2010     2021 2009               2011 2017 2012    2013\r\n                                                                           2015                   2010\r\n                                                                      2020\r\n                                                                           2018\r\n\r\n\r\n                                                                             2016\r\n                                                                      2014\r\n                                               2007                          2011          2009\r\n                                                        2007                                      2010\r\n                                                                             2012\r\n                                                                      2013                 2008\r\n                                                                      2015\r\n\r\n\r\n                                                  0                                  5                   10           15                     20\r\n\r\n\r\n\r\nFigure 10: Exchange Server Releases Per Year\r\n\r\n\r\n\r\n                                                                                                                 Industry Cyber-Exposure Report (ICER): Nikei 225 19\r\n\fAnd, the outlook is still pretty grim across industries.19 Figure 11 shows release and support status of\r\nExchange deployments in each industry, and virtually all of them are having trouble keeping current.\r\n\r\n\r\n\r\n       Exchange Server Release Date and Up-to-Date Status by Industry\r\n                                       Jan    Jan    Jan    Jan    Jan    Jan    Jan    Jan    Jan    Jan    Jan    Jan\r\n                                      2010   2011   2012   2013   2014   2015   2016   2017   2018   2019   2020   2021\r\n\r\n\r\n            Capital Goods/Others                                                                                                Latest Version\r\n                                                                                                                                Older Version\r\n                 Consumer Goods\r\n\r\n                                                                                                                            # Servers\r\n                         Materials\r\n                                                                                                                                2\r\n                                                                                                                                4\r\n                       Technology\r\n                                                                                                                                6\r\n                                                                                                                                8\r\n       Transportation and Utilities\r\n                                                                                                                                10\r\n\r\n                                       Jan    Jan    Jan    Jan    Jan    Jan    Jan    Jan    Jan    Jan    Jan    Jan\r\n                                      2010   2011   2012   2013   2014   2015   2016   2017   2018   2019   2020   2021\r\n\r\n\r\n\r\n\r\nFigure 11: Exchange Server Release Date and Up-to-date Status by Industry\r\n\r\n\r\n\r\nIf keeping Exchange deployments updated, secure, and resilient is a challenge for you, take some comfort in the\r\nfact that even Microsoft has issues normalizing hosted Exchange (Microsoft 365) build levels, though this chart\r\nis far less shameful than the December 2020 snapshot used in the Fortune 500 ICER where their most current\r\ndeployments were firmly “stuck in the middle” of the chart, with an almost equal number of dispersed versions\r\nlingering on the internet’s edges.\r\n\r\n\r\n\r\n\r\n19\r\n     Yes, we took the obvious pun.\r\n\r\n\r\n                                                                                              Industry Cyber-Exposure Report (ICER): Nikei 225 20\r\n\f        Azure Hosted Exchange Deployments\r\n        Microsoft's hosted Exchange has a major.minor version of 15.20.x\r\n        We picked up 17 distinct build version in our (late) March 2021 Sonar Exchange study.\r\n                  1,200\r\n      # Servers\r\n\r\n\r\n\r\n\r\n                   900\r\n\r\n\r\n\r\n                   600\r\n\r\n\r\n\r\n                   300\r\n\r\n\r\n\r\n                     0\r\n                          3045   3109   3412   3433   3499   3611   3676   3700   3784   3825   3846   3868   3890   3912   3933      3955      3977\r\n                                                                                                                                   15.20.x Build number\r\n\r\n\r\n\r\nFigure 12: Azure Hosted Exchange Deployments\r\n\r\n\r\n\r\nCISO Takeaways\r\nFor this chapter, we’ll be talking to 2 different sets of CISOs: those who see their image reflected in the mirrors\r\nin each of the sections, and those who have organizations like this as business partners or suppliers.\r\n\r\n\r\nIf you’re a security leader who is working to build resilience and safety into the DNA of your organization, issues\r\nsuch as technology sprawl, version management, and critical-service maintenance are non-negotiable must-\r\nhaves. The good news is that these aren’t just “security” issues. Organizations deploy services to meet a busi-\r\nness need, and it is far easier to sustain service uptime and stability if there are fewer moving parts to maintain.\r\nTo achieve buy-in with your peers, collect historical and current data regarding service degradation (and/or out-\r\nages). Add to that data how long it takes IT, application, and operations teams to support each component of\r\neach business process. If you pair that up with information on the volume and severity of identified weaknesses\r\n(CVE-based or otherwise), you will find areas that have a solid business case to warrant partnering for improve-\r\nment. As each area ameliorates, you’ll have far more agency to affect change in other, lagging areas.\r\n\r\n\r\nFor those who shuddered at what this section revealed, make sure these are areas you look for when evaluat-\r\ning third parties on behalf of business-process stakeholders in your organization. It’s fairly straightforward to\r\nboth ensure you’re asking about these potential areas of weakness and verifying20 that the answers you receive\r\nare accurate. There’s no guarantee that the internal exposure of organizations reflects what is seen externally.\r\nHowever, it is generally more likely that the internal picture is even worse than what is presented to the outside\r\nworld. Holding your partners and suppliers to a higher level of safety and resilience will not only lessen the risk\r\nto your organization, but can also have a cascading positive effect as other organizations follow the standards\r\nyou’re setting.\r\n\r\n\r\n\r\n\r\n20\r\n     For free, even! https://opendata.rapid7.com/\r\n\r\n\r\n                                                                                                Industry Cyber-Exposure Report (ICER): Nikei 225 21\r\n\fHigh-Risk Services\r\nAmong the Nikkei 225\r\n\fThere are certain services that are generally considered to be high-risk when found available on the public\r\ninternet. For example, with very few exceptions21, placing SMB file shares on the internet is considered a Bad\r\nThing. Doing so may expose data, leak environmental information such as domain names, enable brute-\r\nforce attacks against credentials, and provide a vector for exploiting vulnerabilities in the Windows Server\r\nMessage Block (SMB) implementation, as was seen in the Conficker22 and WannaCry23 worms.\r\n\r\n\r\nIn our research across the public internet, we know that we’re only seeing a surface level of information,\r\nand we often try to find ways to understand what it is telling us about the organisations that operate these\r\nservices. We can look at configuration and protocol details and use them as proxy markers for the internal\r\nenvironment and security maturity of an organisation.\r\n\r\n\r\nFor example, if we discover an SMB service and can detect that it doesn’t support SMBv224, which was intro-\r\nduced in Windows Vista25 and Server 2008, we can make certain assumptions about the age of the operat-\r\ning system and/or requirements for legacy compatibility.\r\n\r\n\r\nIf an organisation permits Telnet26 connections to routers from a different country, we can make assump-\r\ntions about the age of the equipment as well as the security policies for secure protocols and network ac-\r\ncess control lists (ACLs).\r\n\r\n\r\nIn order to get a sense of how well the Nikkei 225 organisations were performing in this area, we surveyed\r\nSMB, Windows Remote Desktop Protocol (RDP), and Telnet on the default ports in their public IPv4 address\r\nspace and reviewed service data where present.\r\n\r\n\r\nOur findings show that:\r\n\r\n         •    There is still significant usage of Telnet-based control for routers and switches.\r\n         •    Of those hosts exposing SMB, all leaked the SMB hostname, DNS name, and fully qualified domain\r\n              name (FQDN) configured on the host.\r\n         •    89 RDP services were found across 18 companies. These were heavily skewed toward the Consumer\r\n              Goods industry vertical due to the outsized impact of one company.\r\n\r\n\r\nWe used Project Sonar and Recog to identify internet-facing SMB, Windows Remote Desktop Protocol\r\n(RDP)27, and Telnet services on the default ports that were in use for each organisation in the Nikkei 225. In\r\neach case, we fully negotiated the protocol to verify that we were indeed communicating with the expected\r\nservice. This methodology has some limitations in that the results are constrained by the fact that:\r\n\r\n\r\n\r\n\r\n21\r\n     https://docs.microsoft.com/en-us/sysinternals/\r\n22\r\n     https://en.wikipedia.org/wiki/Conficker\r\n23\r\n     https://en.wikipedia.org/wiki/WannaCry_ransomware_attack\r\n24\r\n     https://wiki.wireshark.org/SMB2\r\n25\r\n     Which now old enough to drive in most states (it was born in November 2006)\r\n26\r\n     https://en.wikipedia.org/wiki/Telnet\r\n27\r\n     https://en.wikipedia.org/wiki/Remote_Desktop_Protocol\r\n\r\n\r\n                                                                                   Industry Cyber-Exposure Report (ICER): Nikei 225 23\r\n\fThis methodology has some limitations in that the results are constrained by the fact that:\r\n\r\n\r\n       •   Services are only observed on the default ports. Telnet and, less commonly, RDP can be moved to\r\n           non-default ports.\r\n       •   Measurements are made only in IPv4-space.\r\n       •   Certain IP ranges are not examined by Sonar, by request.\r\n       •   Certain cloud and ISP-related ranges were excluded. The impact of this will vary greatly from compa-\r\n           ny to company.\r\n       •   Certain networks were excluded if they were believed to be assigned to customers or otherwise allo-\r\n           cated to third parties.\r\n\r\nAll things being equal, these constraints generally result in underreporting of the findings.\r\nWe’d like to make a special call out here as it relates to SMB protocols on ISP networks. As is our standard,\r\nwe’ve excluded some networks from our datasets which are being used by ISP subdivisions of Nikkei 225 com-\r\npanies. We’ve done this because the results aren’t reflective of the corporate security practices of the organiza-\r\ntions on whom we are focusing. That being said, we do want to call out that we observed nearly 900 more SMB\r\nendpoints on those ISP-assigned networks. Given the risks associated with SMB, we urge residential and com-\r\nmercial ISPs to start blocking SMB traffic entirely.\r\n\r\n\r\n\r\nFindings: RDP, SMB, and Telnet\r\nWe should start this section by stating that any non-zero number of these services made available to the gen-\r\neral internet is considered to be unacceptable in organisations with mature security programmes. Followers of\r\nthe Rapid7 blog and past Rapid7 research reports will be quite familiar with this advice, but looking at the cal-\r\nendar here in 2021, we have to note that it’s been a while since the last major worm outbreak on the internet.\r\nNotPetya (SMB) was 2018, WannaCry (also SMB) was 2017, and Mirai (Telnet) was way back in 2016. Despite all\r\nthe vulnerability and exploit churn we saw in 2019 and 2020, we appear to be overdue for another self-replicat-\r\ning issue across open ports to insecure services. Closing off your exposure to these services will certainly save\r\nyou weeks of cleanup later.\r\n\r\n\r\n\r\nWindows Remote Desktop Protocol (RDP)\r\nWhile some may think that RDP should be considered an exception to this rule, we’d argue that there are com-\r\nmonly available techniques and technologies such virtual private networks (VPNs), RDP Gateway servers, and\r\nfirewall access control lists (ACLs) that remove the risk related to this technology and so, as a general rule, RDP\r\nshouldn’t be exposed to source addresses outside of the organisation.\r\n\r\n\r\nSince we’re on the topic of RDP, let’s start with the discussion with the findings there. On the default RDP port\r\nof 3389/tcp, we observed 89 services across 18 companies. One organisation in the Consumer Goods industry\r\naccounted for 45% of the observed RDP services.\r\n\r\n\r\n\r\n\r\n                                                                      Industry Cyber-Exposure Report (ICER): Nikei 225 24\r\n\f        Port 3389 Distribution by Industry\r\n        Each dot represents one organisation; position on X axis = number of servers discovered owned by that company\r\n                                                                                                      Number of servers\r\n                                       1        10            20              30               40                  50\r\n\r\n             Capital Goods/Others\r\n\r\n                  Consumer Goods\r\n\r\n                         Financials\r\n\r\n                          Materials\r\n\r\n                        Technology\r\n\r\n        Transportation and Utilities\r\n\r\n                                       1        10            20              30               40                  50\r\n\r\n\r\n\r\n\r\nFigure 13: Port 3389 Distribution by Industry\r\n\r\n\r\n\r\n\r\nThe graphic above shows that, while the overall numbers are mostly attributable to just a few companies, we do\r\nsee quite a few industries represented.\r\n\r\n\r\nOn a positive note, when we looked at the security requirements for RDP authentication, we found that 94% re-\r\nquired Network-Level Authentication (NLA).28 NLA, introduced in Windows Server 2008, enforces Transport Layer\r\nSecurity (TLS) protection of traffic in-flight, strengthens authentication options, and significantly reduces the risk\r\nand impacts related to brute force and certain denial-of-service attacks. NLA has been enabled by default since\r\nWindows 2012. The lack of NLA serves as a proxy indicator for older infrastructure, either on the server itself or\r\na requirement for compatibility with older clients. The only other reason for not having NLA enabled is that it\r\ndoesn’t allow authentication with expired passwords. That is another reason to deploy RDP Gateway servers,\r\nVPNs, or other infrastructure to provide facilities for changing the password as well as enable security access to\r\nremote desktop services.\r\n\r\n\r\n\r\nWindows Remote Desktop Protocol (RDP)\r\nThe SMB protocol is for file- and print-sharing as well as interprocess communication on Windows and compat-\r\nible networks. We say this in every report29, but SMB should never be exposed to the internet. The risks include\r\ndata leakage from file shares, credential compromise via brute force attacks, and malware infection (think of\r\nthe previously noted Conficker and WannaCry) via vulnerabilities in the host operating system or service. Given\r\nthe plethora of options for securely sharing files, SMB shares aren’t worth the risk.\r\n\r\n\r\n\r\n\r\n 28\r\n      https://en.wikipedia.org/wiki/Network_Level_Authentication\r\n 29\r\n      https://www.rapid7.com/research/report/nicer-2020/#smb-tcp-445\r\n\r\n\r\n                                                                               Industry Cyber-Exposure Report (ICER): Nikei 225 25\r\n\fWhen we surveyed the Nikkei 225, we looked at 2 different SMB ports: 139/tcp and 445/tcp. Port 139/tcp is\r\nused for older variants of SMB, and its presence is generally a sign of very old software and legacy require-\r\nments. In our surveys, we found 25 servers across 6 companies exposed over port 139/tcp. They were all running\r\nan open source SMB server called Samba30. The oldest version of Samba we observed, 3.0.36, was released in\r\nlate 2009 and contains quite a few critical vulnerabilities.\r\n\r\n\r\n\r\n                 Port 139 Distribution by Industry\r\n                 Each dot represents one organisation; position on X axis = number of servers discovered owned by that company\r\n                                                                                                                        Number of servers\r\n                                                  1        5        10          15              20            25                    30\r\n\r\n                           Consumer Goods\r\n\r\n\r\n                                 Technology\r\n\r\n\r\n                 Transportation and Utilities\r\n\r\n                                                  1        5        10          15              20            25                    30\r\n\r\n\r\n\r\n\r\nFigure 14: Port 139 Distribution by Industry\r\n\r\n\r\n\r\nWe also surveyed SMB on port 445/tcp. Introduced in Windows 2000, this transport for SMB removed some of\r\nthe legacy protocol overhead. In our research, we observed 146 servers across 17 organisations on this port.\r\n\r\n\r\n\r\n                   Port 445 Distribution by Industry\r\n                   Each dot represents one organisation; position on X axis = number of servers discovered owned by that company\r\n                                                                                                                    Number of servers\r\n                                                  1   10       20        30      40        50         60           70            80\r\n\r\n                         Capital G oods/Others\r\n\r\n                             Consumer G oods\r\n\r\n                                     Materials\r\n\r\n                                   Technology\r\n\r\n                   Transportation and Utilities\r\n\r\n                                                  1   10       20        30      40        50         60           70             80\r\n\r\n\r\n\r\n\r\nFigure 15: Port 3389 Distribution by Industry\r\n\r\n\r\n\r\n\r\n 30\r\n      https://www.samba.org/\r\n\r\n\r\n                                                                                        Industry Cyber-Exposure Report (ICER): Nikei 225 26\r\n\fThe mere presence of these SMB servers on the internet is cause for concern, but when we dug into the proto-\r\ncol configurations, the concern increased. All servers supported SMBv1, which means they are missing several\r\ncritical security controls, and attackers can force clients to downgrade to SMBv1 from more secure versions of\r\nthe protocol. All of the 146 servers we observed supported a newer version of SMB and so, absent a dependen-\r\ncy by legacy systems, shouldn’t need to have SMBv1 enabled. We strongly recommend Microsoft’s guidance to\r\ndisable SMBv1.31\r\n\r\n\r\nSMBv3 was released with Windows Server 2012 and included many security and performance improvements32,\r\nsuch as encryption of data on the wire and protocol downgrade protections. SMBv3 was supported on 68% of\r\nthe observed servers.\r\n\r\n\r\nThese SMB services also leaked information about the organisation. All of the services provided a hostnam-\r\ne,DNS name, and fully qualified domain name (FQDN) configured on the host. This information may indicate role\r\n(VCENTER01) or indicate internal organisational structure (db1.prod.us.corp.local).\r\n\r\n\r\n\r\nTelnet\r\nTelnet is a plaintext-based protocol used for providing remote console access to devices. It nearly always trans-\r\nmits credentials and data in cleartext and has no protections against man-in-the-middle (MiTM) injection of\r\ncommands or data.\r\n\r\n\r\nOriginally specified in 1969, Telnet is well past its “Use By” date and has been superseded by other, more secure\r\ntechnologies such as SSH. Our survey found 243 hosts across 62 companies. The majority of these hosts were in\r\nthe Technology sector.\r\n\r\n\r\n\r\n\r\n       Port 23 Distribution by Industry\r\n       Each dot represents one organisation; position on X axis = number of servers discovered owned by that company\r\n                                                                                                                   Number of servers\r\n                                      1          10                  20                  30                 40                  50\r\n\r\n            Capital Goods/Others\r\n\r\n                 Consumer Goods\r\n\r\n                        Financials\r\n\r\n                         Materials\r\n\r\n                       Technology\r\n\r\n       Transportation and Utilities\r\n\r\n                                      1          10                  20                  30                 40                  50\r\n\r\n\r\n\r\nFigure 16: Port 23 Distribution by Industry\r\n\r\n\r\n\r\n\r\n31\r\n     https://techcommunity.microsoft.com/t5/storage-at-microsoft/stop-using-smb1/ba-p/425858\r\n32\r\n     https://docs.microsoft.com/en-us/windows-server/storage/file-server/file-server-smb-overview\r\n\r\n\r\n                                                                                    Industry Cyber-Exposure Report (ICER): Nikei 225 27\r\n\fMost of the equipment was found to be a router or switch. As a general rule, it’s considered insecure to use Tel-\r\nnet as opposed to more secure protocols such as SSH.\r\n\r\n\r\nAlso, if Telnet is unavoidable, firewall access control lists (ACLs) and other controls should be used to limit which\r\ninternet IP addresses can access the devices. Since our survey process had to make connections from multiple\r\nIPs—in some cases in different countries—to validate a service, we can say that ACLs were likely not in place or\r\nwere overly broad.\r\n\r\n\r\nExposure Overview\r\nWhen we look across the surveyed protocols and industries, we can see that there are certain hotspots.\r\n\r\n\r\n\r\n\r\n                   High-Risk Exposure by Industry Heatmap\r\n                     Capital          Consumer                                                Transportation\r\n                   Goods/Others        Goods        Financials   Materials     Technology      and Utilities\r\n\r\n\r\n             139                        1 org /                                   4 orgs /         1 org /\r\n                                      18 servers                                 6 servers        1 server\r\n\r\n\r\n\r\n\r\n             445       1 org /          1 org /                   2 orgs /       10 orgs /        3 orgs /\r\n                     11 servers       71 servers                 2 servers      58 servers       4 servers\r\n\r\n\r\n\r\n\r\n            3389      2 orgs /          1 org /       1 org /     4 orgs /       8 orgs /         2 orgs /\r\n                     10 servers       40 servers     1 server    10 servers     25 servers       3 servers\r\n\r\n\r\n\r\n\r\n              23      11 orgs /        9 orgs /      3 orgs /     14 orgs /      21 orgs /        4 orgs /\r\n                     62 servers       35 servers    17 servers   36 servers     88 servers       5 servers\r\n\r\n\r\n\r\n\r\nFigure 17: High-Risk Exposure by Industry Heatmap\r\n\r\n\r\n\r\n\r\n                                                                         Industry Cyber-Exposure Report (ICER): Nikei 225 28\r\n\fThere are a couple of points that should stand out in the graphic above. First, the SMB-related rows (135, 445 )\r\nshould be entirely empty, but they are not.\r\n\r\n\r\nThough 1 organization in the Consumer Goods industry dominates the findings there are 16 others who are also\r\nexposing these services as well. Second, we see heavy and widespread Telnet usage across many industry verti-\r\ncals here. Finally, most of the RDP exposure is in the Consumer Goods industry and is due to the outsized impact\r\nof just 1 company (which we will not name for obvious reasons).\r\n\r\n\r\n\r\nCISO Takeaways\r\nThe findings here indicate that even some of the most resourced companies are exposing services that have an\r\noutsized risk.\r\n\r\n\r\nOur guidance for addressing the risks above isn’t to implement some advanced security controls or software,\r\nbut to instead return to the basics. You can find all of them in the early parts of the CIS Top 2033 controls.\r\n\r\n          •   Develop and maintain an inventory of internet-facing hosts that includes software versions, roles, and\r\n              services that are expected to be exposed, as well as the reason why. Make sure that this inventory is\r\n              validated by outside-in scans of all of your public-facing IP ranges.\r\n\r\n\r\n          •   Implement security policies and supporting configuration standards that enforce the use of secure\r\n              protocols and configuration settings. Using the example of Telnet, every device currently using Telnet\r\n              should be able to support SSH—and if it doesn’t, it is too old or insecure to be directly connected to\r\n              the internet.\r\n\r\n\r\n          •   Ensure that software and hardware are kept current. In many cases, such as with Microsoft Windows,\r\n              newer software brings better security features and controls. Older software’s lack of these features\r\n              can force security trade-offs and require the implementation of compensating controls, which add\r\n              complexity.\r\n\r\n\r\n\r\n\r\n33\r\n     https://www.cisecurity.org/controls/cis-controls-list/\r\n\r\n\r\n                                                                          Industry Cyber-Exposure Report (ICER): Nikei 225 29\r\n\fVulnerability Disclosure Programs\r\nAmong the Nikkei 225\r\n\fEvery major corporation on Earth is a technology company34. It is unthinkable that a business that generates bil-\r\nlions of Euros in revenue and employs thousands of workers worldwide would not have a significant technologi-\r\ncal investment in their products, processes, and logistics. We rely on fantastically advanced technology in every\r\naspect of our modern lives. Of course, anyone who has spent any time analysing these technologies will notice\r\nwe are routinely bedevilled with vulnerabilities, especially when it comes to internet-based technologies.\r\n\r\n\r\nAs it happens, we have a powerful and proven method to stem the tide of vulnerabilities in major technologies:\r\ncoordinated vulnerability disclosure35 (CVD), and a now-standard mechanism to participate in CVD, vulnerabili-\r\nty-disclosure programmes36 (VDPs).\r\n\r\n\r\nThe presence of a publicly accessible VDP is conspicuously lacking across most of the companies listed in the\r\nNikkei 225, which, in turn, makes it difficult for those companies to ever learn about vulnerabilities in their prod-\r\nucts and technical infrastructure in a constructive way.\r\n\r\n\r\nWhile VDPs are more common today among the U.S.-based Fortune 500 (about 20%), these programmes are\r\nlargely absent in the Nikkei 225: Only 16 of the exchange-listed companies (or about 7%) have a discoverable\r\nVDP. Without vulnerability-disclosure programmes, these industries are telegraphing that they do not want to\r\nknow about their own vulnerabilities, intentionally or not, to their shareholders’ and customers’ peril.\r\nFor this study, we searched for VDPs associated with the Nikkei 225-listed companies and the flagship brands\r\nof those companies, much in the same way we would if we were about to disclose a vulnerability about those\r\ncompanies’ products or services. At the end of May 2021, we looked for the following, in this order:\r\n\r\n\r\n          •   The presence of a VDP associated with all Nikkei 225-listed companies (or flagship brands of those\r\n              companies) listed on either Bugcrowd’s37 or HackerOne’s38 crowdsourced bug bounty lists, or in the\r\n              Disclose.io39 program database.\r\n          •   The presence of a standardized security.txt file on each company or flagship brand website to facili-\r\n              tate the sharing of discovered vulnerabilities with website maintainers.\r\n          •   An obvious pointer to, or indication of, a VDP offered by the candidate companies by Googling the\r\n              terms “vulnerability,” “disclosure,” and “security” along with the company name and flagship brand.\r\n\r\n\r\nAll this said, it is possible some of the surveyed companies that appear to not offer a VDP do, in fact, have a pro-\r\ncess for receiving vulnerability intelligence, but the lack of an easily discoverable VDP (in either the company’s\r\npreferred language or in English) drastically undercuts the effectiveness of the VDP for both researchers and the\r\ncompanies.\r\n\r\n\r\n\r\n\r\n34\r\n     https://www.wsj.com/articles/every-company-is-now-a-tech-company-1543901207\r\n35\r\n     https://blog.rapid7.com/2018/10/31/prioritizing-the-fundamentals-of-coordinated-vulnerability-disclosure/\r\n36\r\n     https://blog.rapid7.com/2016/11/28/never-fear-vulnerability-disclosure-is-here/\r\n37\r\n     https://www.bugcrowd.com/bug-bounty-list/\r\n38\r\n     https://hackerone.com/directory/programs\r\n39\r\n     https://github.com/disclose/diodb/\r\n\r\n                                                                                     Industry Cyber-Exposure Report (ICER): Nikei 225 31\r\n\fAssessing the relative merits of individual VDPs is beyond the scope of this paper, but it should be noted that\r\nnot all VDPs are created equal—some offer robust “safe harbor” protections for researchers and accidental\r\ndiscoverers when reporting and publishing vulnerabilities, while others seek to bind researchers in restrictive\r\nagreements about what can be assessed and how results are to be handled and communicated. For this paper,\r\nthe mere existence of a VDP, no matter how liberal or restrictive, counts as a positive.\r\n\r\n\r\nResults: Prevalence of VDP Adoption\r\nIn January 2019, Bugcrowd founder and noted Australian Casey Ellis remarked in a blog post that “only 9% of\r\nthe Fortune 500 run vulnerability-disclosure programmes.40” This is just a touch higher than what we found in\r\nJapan in the first half of 2021.\r\n\r\n\r\nWe were able to discover a total of 16 vulnerability-disclosure programmes across the 225 ticker symbols inves-\r\ntigated in May 2021, which accounts for about 7% of the Nikkei 225 listings.\r\n\r\n\r\nWith such a low showing, it’s difficult to say that any particular industry or valuation quintile has normalized the\r\npractice of advertising a VDP. That said, the industry most represented in the positive findings is Technology\r\n(13), followed by Consumer Goods (3), and even these Consumer Goods corporations have a decidedly technical\r\nbent.\r\n\r\n\r\n\r\n   Nikkei 225 Vulnerability Disclosure Programme (VDP) Status by Industry\r\n   There is a tiny oasis of companies ready to handle inbounds for vulnerability issues in an otherwise VDP desert.\r\n\r\n\r\n\r\n\r\n                                               Consumer Goods (3/33)     Technology (13/58)      No VDP\r\n\r\nFigure 18: Nikkei Vulnerability Disclosure Program (VDP) Status by Industry\r\n\r\n\r\n\r\n 40\r\n      https://www.bugcrowd.com/blog/3-reasons-why-every-company-should-have-a-vdp/\r\n\r\n\r\n                                                                                       Industry Cyber-Exposure Report (ICER): Nikei 225 32\r\n\fVDPs appear to be wholly absent in major segments of the Japanese economy; namely in Capital Goods/Others\r\n(which is largely heavy machinery and real estate), Financials, Materials, and Transportation & Utilities.\r\n\r\n\r\nThe key takeaway from this view of the Nikkei 225 is that, while all major companies have some technical com-\r\nponent (and therefore have technical vulnerabilities), over 90% of these top companies in Japan lack a formal\r\nvulnerability-disclosure program.\r\n\r\n\r\nJapan, however, is something of a unique case — since 2004, Japanese companies have been encouraged by\r\nthe Japanese government to work with the Information-Technology Promotion Agency41 (IPA) and JPCERT/CC42.\r\nThe IPA was established directly by the Japanese government, while JPCERT/CC is a non-government organi-\r\nzation that is largely funded by public money. These two organizations are dedicated to protecting national IT\r\ninterests, with IPA handling website issues and JPCERT/CC picking up the remainder of software and firmware\r\nissues43 for triage through resolution.\r\n\r\n\r\nThat said, these entities should be considered legacy infrastructure when it comes to VDP. There is simply too\r\nmuch technology floating around for one or two government-funded agencies to handle, on top of securing gov-\r\nernment assets themselves. The lack of VDPs across the upper echelons of the Japanese economy discourages\r\nthe reasonable and responsible disclosure of newly discovered vulnerabilities in their products, services, and\r\ninfrastructure. After all, VDPs aren’t just for reporting software bugs in software applications, but are also useful\r\nfor reporting the discovery of sensitive data found about customers or company internals left open on insecure\r\ncloud storage. It is, of course, possible to disclose vulnerabilities to companies in industries without a formal\r\nVDP, but the lack of VDPs introduces inefficiencies for the companies and legal risk to researchers.\r\n\r\n\r\nFinally, a functioning VDP signals that a given company has made some investment in their overall informa-\r\ntion-security program, so it stands to reason that the lack of a VDP is signaling the opposite. Every company\r\non this list has a website privacy policy, so every company should have some formal method for receiving\r\nand handling vulnerability reports.\r\n\r\n\r\n\r\nCISO Takeaways\r\nHopefully, it is obvious by now that the authors of this paper are strong proponents of clearly defined, easily dis-\r\ncoverable vulnerability-disclosure programmes. We believe that every company in the Nikkei 225 (and beyond)\r\nshould adopt one.\r\n\r\n\r\nLaunching and running a successful VDP may be tricky—after all, the presence of a VDP implies a level of secu-\r\nrity maturity that may not yet exist at a given company, so CISOs at organisations without a VDP are strongly\r\nencouraged to familiarise themselves with the basics of vulnerability disclosure.\r\n\r\n\r\n\r\n\r\n41\r\n   https://www.ipa.go.jp/\r\n42\r\n   https://www.jpcert.or.jp/\r\n43\r\n   For more on the unique Japanese approach to vulnerability handling, see “Information Security Early Warning Partnership” at\r\n<https://www.ipa.go.jp/files/000059696.pdf>.\r\n\r\n\r\n                                                                                  Industry Cyber-Exposure Report (ICER): Nikei 225 33\r\n\fWe believe there is a critical mass of CISO expertise in building and maintaining VDPs and that there is plenty of\r\nopportunity to learn from the experiences of others in the field. In our experience, not only do CISOs personally\r\nenjoy discussing their VDP experiences, but it can be hard to stop them when they get going.\r\n\r\n\r\nISO 2914744 (Information technology—Security techniques—Vulnerability disclosure) and ISO 3011145 (Informa-\r\ntion technology—Security techniques—Vulnerability handling processes) are excellent starting points for build-\r\ning, maintaining, and improving a vulnerability-disclosure programme. These ISOs were developed in partnership\r\nwith internationally recognised experts in the field of vulnerability disclosure, and can help any CISO get a leg\r\nup.\r\n\r\n\r\nAnother, first-step approach to establishing a minimal VDP is a contact and policy document placed at\r\n<hxxps://your-company.com/.well-known/security.txt>. This is a relatively new standard for VDP communication\r\nthat provides for basic contact information signalling, readable by both humans and machines.46\r\n\r\n\r\n\r\n\r\n 44\r\n      https://www.iso.org/standard/72311.html\r\n 45\r\n      https://www.iso.org/standard/69725.html\r\n 46\r\n      Interested CISOs can read up on it at https://securitytxt.org/\r\n\r\n\r\n                                                                       Industry Cyber-Exposure Report (ICER): Nikei 225 34\r\n\fConclusion\r\n\fThe global COVID-19 pandemic forced many of these companies to abruptly shift to a large work-from-home\r\nworkforce in short order, and each company is its own miracle of corporate survival in the face of such drastic\r\nand unprecedented changes to the workplace. In addition, Japanese companies are doing pretty well in stamp-\r\ning out dangerously exposed services and version dispersion when compared to other regions surveyed by\r\nRapid7.\r\n\r\n\r\nHowever, these companies are lagging their international counterparts in the 3 other areas we measured for\r\nthis report: adoption of DMARC, HSTS, and VDPs. More progress must be made, and faster. Because of their\r\noutsized position in the Japanese business community, they also tend to have access to the best and brightest\r\ncybersecurity experts from around the world, and so it is incumbent upon them to behave more like model inter-\r\nnet citizens. The researchers at Rapid7 who contributed to this report sincerely hope these companies—and the\r\norganizations that have business relationships with them—find this information and advice useful in our shared\r\nresponsibility of advancing security for everyone.\r\n\r\n\r\n\r\nCISO at a Glance\r\nThroughout this report, we’ve kept our focus on what CISOs in the Nikkei 225 can do, today, to reduce their ex-\r\nposure to the most common issues we’ve discussed here. For the reader’s convenience, those recommendations\r\nare summarised here.\r\n\r\n\r\nEmail Security: If you’re on the Domain-based Message Authentication, Reporting & Conformance (DMARC)\r\npath, like 13% of the Nikkei 225, that’s great! Now is the time to plan out how you’ll move from a p=none to a\r\np=quarantine policy, and ultimately a p=reject policy. This is not an easy journey, since you will certainly uncover\r\npockets of shadow IT running their own email infrastructure, but the confidence of being able to authenticate\r\nmail from your major brand domains is a pretty great feeling, and a nice item to report to your board of direc-\r\ntors.\r\n\r\n\r\nWeb Security: HTTP Strict Transport Security (HSTS) is rapidly becoming table stakes for running a reasonably\r\nsecure website, and this is the kind of security feature that browser manufacturers like Google, Apple, Microsoft,\r\nand Mozilla are likely to enforce in future versions of Chrome, Safari, Edge, and Firefox. It’s a relatively easy\r\nswitch that CISOs can flick (compared to the universe of nice-to-haves in cybersecurity, anyway), so take some\r\ntime to investigate whether your organisation is using HSTS and if not, why not?\r\n\r\n\r\nVersion Dispersion: For the mega-corporations that roam the fields of capitalism, mergers and acquisitions\r\nare a fairly common activity throughout the year. That means the Nikkei 225 CISO is never truly “done” with\r\nensuring version consistency across the enterprise, even after investing in an excellent asset and vulnerability\r\nmanagement toolchain. New networks and network services will join your ranks, and that means undertaking a\r\nfairly continuous modernization and normalization effort for those new assets. Taking on this continuous effort\r\nwill pay off in easier, more straightforward planning for the next patch cycle, scheduled or surprise.\r\n\r\n\r\n\r\n\r\n                                                                       Industry Cyber-Exposure Report (ICER): Nikei 225 36\r\n\fHigh-Risk Services: Telnet, SMB, and RDP have no business being exposed directly to the world at large, and\r\nare just waiting for the next self-replicating cyberattack to sweep across the internet. An up-to-date inventory of\r\nexposed services, sourced from internal and external scanning, is worth its virtual weight in Bitcoin, and will help\r\nyou enforce a no-nonsense policy of network service exposure to the internet. As stated above, though, there\r\nare very few of these exposed services left in the Nikkei 225 as of 2021.\r\n\r\n\r\nVulnerability Disclosure Programs: As a CISO, you might have hired the best of the best software, QA, and\r\nplatform engineers. But, without a good way to harness the smarts of the tens of thousands of talented hackers\r\naround the world, you may never learn about the most critical vulnerabilities in your products and services. A\r\nVDP is a bridge to that enormous community of well-meaning investigators who have goals aligned with your\r\nown: a safer and more secure internet. Getting that program spun up now will give you plenty of time to prac-\r\ntice safer software production. As a bonus, most of the pioneering work is already done for you, in the form of\r\nISO 29147 and ISO 30111.\r\n\r\n\r\n\r\n\r\n                                                                      Industry Cyber-Exposure Report (ICER): Nikei 225 37\r\n\fAppendix: Prioritization\r\nin Times of Crisis\r\nThe disclosure of both the SolarWinds-related multiple-technology vulnerabilities (and associ-\r\nated campaigns), the release of the out-of-band Microsoft Exchange patches responding to ac-\r\ntive exploitation campaigns, and the Codecov compromise that will undoubtedly impact many,\r\nmany software development CI/CD processes, have all strained virtually every single informa-\r\ntion-security team in every industry. We wanted to take a moment to help ensure you’re on\r\nsafer ground now, and also put each section into context, relative to some of the crises we’ve\r\nhad to deal with this year.\r\n\r\n\r\nThe SolarWinds and Codecov situation brought third-party risk square into focus like it has nev-\r\ner been before. If you had a solid list of partners/vendors and a well-oiled contact plan (which\r\nmany organizations did), you may have weathered that portion of these extended incidents\r\nfairly well. If not, we hope you had the support required to put such things in place and have\r\nbeen able to use it in some subsequent serious vulnerability disclosures and exploit campaigns\r\nsince.\r\n\r\n\r\nWhen it comes to being able to get a feel for how well a partner/vendor values safety and\r\nresilience, you may want to heed the advice in the “CISO Takeaway” section. It’s much easi-\r\ner to sleep at night knowing that the bulk of your third-party contacts prioritize email safety,\r\navoid exposing dangerous services to the internet, and stay current with both patching and\r\nadvanced encryption standards. You will also know how to contact them in the event you do\r\ndiscover a security issue with any of their products and services, since they’ll have a vulnerabili-\r\nty-disclosure program in place.\r\n\r\n\r\nSimilarly, the massive Exchange vulnerability and associated malicious campaigns further\r\ndemonstrated how quickly 1 weakness in a component used by hundreds of thousands of\r\norganisations can come out of the blue to disrupt execution on even the most well-crafted en-\r\nterprise information-security roadmap. Having current, accurate telemetry of what is deployed\r\ninternally and externally, along with highly agile quality assurance and change management\r\nprocesses (as noted in the section on version complexity), can be the difference in having an\r\nunexpected patch (like Exchange) be a quick exercise with a slight bit of triage (to ensure at-\r\ntackers did not have time to target you) versus an “all hands on deck” massive incident.\r\n\r\n\r\nWe hope our quantification, context, and advice prove useful as you emerge from these 2\r\nmajor incidents to take on the remaining challenges that await us all in 2021 and beyond."
  },
  "doc-ac183a4652718b84dc5e6eb96aa27198": {
    "content": "2021 Software Vulnerability Snapshot\r\nAn Analysis by Synopsys Application Security Testing Services\r\n\fTable of contents\r\n\r\nOverview.......................................................................................................................................................1\r\n\r\n    Types of Security Testing.....................................................................................................................2\r\n\r\n    About Third-Party Application Security Testing Services.............................................................. 2\r\n\r\n    The Need for a Complete Software Security Testing Spectrum.................................................. 4\r\n\r\nVulnerabilities and Security Issues......................................................................................................... 5\r\n\r\nVulnerabilities Breakdown by the 2021 OWASP Top 10 .................................................................... 5\r\n\r\n    A01:2021—Broken Access Control..................................................................................................... 6\r\n\r\n    A02:2021—Cryptographic Failures .................................................................................................... 7\r\n\r\n    A03:2021—Injection...............................................................................................................................7\r\n\r\n    A05:2021—Security Misconfiguration............................................................................................... 7\r\n\r\n    A07:2021—Identification and Authentication Failures................................................................... 7\r\n\r\nTypes of Tests ............................................................................................................................................7\r\n\r\n    Top Vulnerabilities Found in Mobile Tests Matched Against OWASP Risks.............................. 9\r\n\r\nConclusion and Key Takeaways.............................................................................................................. 10\r\n\r\n    Testing with a Full Spectrum of Security Tools............................................................................... 11\r\n\r\n    Even Lower-Risk Vulnerabilities Can Be Exploited to Facilitate Attacks..................................... 11\r\n\r\n    An Urgent Need for a Software Bill of Materials.............................................................................. 11\r\n\r\nAbout CyRC Research...............................................................................................................................12\r\n\r\n\r\n\r\n\r\n                                                                                                                                                | synopsys.com | 2\r\n\fOverview\r\nSynopsys Cybersecurity Research Center (CyRC) researchers recently examined\r\nanonymized data from commercial software systems and applications tested by\r\nSynopsys application security testing services during 2020. The following report\r\nincludes data from 3,900 tests conducted on 2,600 targets (i.e., software or systems).\r\nAlmost all of the tests (98%) were intrusive “opaque box” and “semi-opaque box” tests,\r\nincluding penetration tests, dynamic application security tests, and mobile application\r\nsecurity analyses.\r\n\r\n\r\n\r\n\r\nIndustries represented in the study\r\n\r\n                                                    Software and Internet\r\n\r\n\r\n                                                                      29%\r\n                                                         Financial Services\r\n\r\n\r\n                                                                      28%\r\n   Business Services\r\n                                                   9%             Media and\r\n                               14%                             Entertainment\r\n\r\n                                                   Healthcare                 5%\r\n 10%\r\n                    Manufacturing                   Other                      5%\r\n                                                                             | synopsys.com | 1\r\n\fTypes of Security Testing\r\nThe majority of the tests—98%—were intrusive “opaque box” and “semi-opaque box” tests, including penetration testing, dynamic\r\napplication security testing, and mobile application security analyses. Opaque box testing approaches the target’s security state\r\nfrom an outsider’s perspective, whereas semi-opaque box testing simulates an authenticated user with credentials—essentially\r\nextending opaque box testing with deeper insights. The tests were designed to probe running applications as a real-world\r\nattacker would, with the goal of identifying vulnerabilities that could then be triaged and remediated as necessary.\r\n\r\nThe targets tested were largely web (83%) and mobile (12%) applications, with the remainder either source code or network\r\nsystems/applications. The industries represented included software and internet (29%), financial services (28%), business\r\nservices (14%), manufacturing (10%), media and entertainment (9%), and healthcare (5%). The remaining 5% of test targets\r\nrepresented education, energy and utilities, and other verticals.\r\n\r\nThe tests focused on identifying software weaknesses, known as Common Weakness Enumerations (CWEs). These are flaws or\r\nerrors in code that when left unaddressed can make software or a system vulnerable to attack.\r\n\r\nAbout Third-Party Application Security Testing Services\r\nOrganizations use third-party application security testing services such as those offered by Synopsys for a variety of reasons.\r\nSome want to validate their own testing and ensure their internal security controls are working. Others need to comply with\r\nregulatory or business requirements that mandate a third-party assessment, while still others want to extend their software\r\nsecurity testing without having to add specialized tools and staff. The 2021 BSIMM12 Insight and Trends report found that 87%\r\nof the organizations participating in the Building Security In Maturity Model (BSIMM) project use external penetration testers to\r\nuncover issues that might have been missed by internal testing.\r\n\r\n\r\n\r\n\r\n               87%\r\n                                                                of the organizations participating\r\n                                                                 in the BSIMM project use external\r\n                                                                  penetration testers to uncover\r\n                                                                   issues that might have been\r\n                                                                    missed by internal teams.\r\n\r\n\r\n\r\n\r\n                                                                                                                  | synopsys.com | 2\r\n\fSynopsys Application Security Testing\r\nServices 2020 by the Numbers\r\n            Number of             Tests That Uncovered\r\n          Test Targets:\r\n                                  Vulnerabilities:\r\n                 2,573\r\n\r\n                                                                     97%\r\n    Number of Tests:\r\n                 3,937                          3,828\r\n\r\n Number of Tests                                         Total Number of\r\n with High or                                            Vulnerabilities\r\n Critical Severity                                       Discovered:\r\n Vulnerabilities:\r\n                                                           28,501\r\n 1,420                              36%\r\nTop Vulnerability            Top High-Risk                   Top Critical Vulnerability\r\nDiscovered: Missing          Vulnerability Discovered:       Discovered: SQL\r\nContent-Security-Policy      Stored Cross-Site               Injection\r\nHeader                       Scripting\r\n\r\n                52%                           28%            3%\r\n\r\nTypes of Tests\r\n                                                  Web App Pen Testing: 2,558 (67%)\r\n             Web App Dynamic Analysis: 630 (16%)\r\n\r\n          Mobile App Testing: 472 (12%)\r\n  Source Code Analysis: 88 (2%)\r\n   Network Security Pen Testing: 75 (2%)\r\n\r\n\r\n\r\n                                                                             | synopsys.com | 3\r\n\fThe Need for a Complete Software Security Testing Spectrum\r\nBusinesses that sell software, or sell products that include embedded software, can’t afford software security, compliance,\r\nor quality issues compromising those products. Even businesses not directly engaged in selling software or software-\r\ndriven products depend on software quality and security. For example, software drives the administrative systems for most\r\npayroll, billing, receivables, sales tracking, and customer records. Software controls production, manages inventories, directs\r\nwarehousing, and runs the distribution systems that keep a business running.\r\n\r\nSoftware is also the primary way that most businesses interact with and support customers, and these systems can also\r\nfall prey to attack. The giant credit risk assessment firm Equifax is not considered a software company, but a breach of the\r\nunderlying software framework of an Equifax customer portal exposed the personal data of 143 million U.S. consumers in 2017.\r\n\r\n\r\n\r\n\r\n   Humans should perform the security tests\r\n   they’re the most effective at carrying out,\r\n\r\n\r\n\r\n\r\n                   with their efforts augmented by\r\n                          automated testing.\r\nSoftware risk is business risk, and to effectively manage the second, you must address the first. While “transparent box” testing\r\nsuch as static application security testing (SAST) can bring visibility to security issues early in the software development life\r\ncycle, SAST cannot uncover runtime security vulnerabilities. And some vulnerabilities cannot be easily detected by automated\r\ntesting tools—they need human oversight to be uncovered.\r\n\r\nFor example, the only effective way to detect an insecure direct object reference (IDOR), an issue that allows attackers to\r\nmanipulate references in order to gain access to unauthorized data, is by having a human perform a manual test. Clearly, there\r\nis no one best approach to application security testing. Humans need to perform the security tests they’re the most effective at\r\ncarrying out, with their efforts augmented by automated testing.\r\n\r\nA full spectrum of application security testing is an essential component of managing software risk in today’s world. When an\r\norganization lacks the needed human resources or tools to perform high-level opaque/semi-opaque box security testing such as\r\npenetration testing, or needs to vet its own software security controls, working with a third party such as Synopsys may be the\r\nbest solution.\r\n\r\n\r\n\r\n\r\n                                                                                                                   | synopsys.com | 4\r\n\fVulnerabilities and Security Issues\r\nOf the 3,900 tests, 97% uncovered some form of vulnerability in the targets. Thirty percent of the total were high-risk\r\nvulnerabilities, and 6% were critical-risk vulnerabilities. The easy availability of automated exploitation tools makes fixing high-\r\nand critical-risk vulnerabilities urgent whenever discovered.\r\n\r\nHigh-risk vulnerabilities such as cross-site scripting (XSS) are issues that could allow attackers to access application resources\r\nand data. Twenty-eight percent of the test targets had exposure to reflected, stored, or DOM-based cross-site scripting\r\nvulnerabilities.\r\n\r\nCritical-risk vulnerabilities allow attackers to execute code on a web application or application server and access sensitive data.\r\nCommon critical-risk vulnerabilities include remote code execution and SQL injection—insertion of a SQL query via the input data\r\nfrom the client to the application. Three percent of the total test targets were vulnerable to some type of SQL injection.\r\n\r\n\r\n\r\n\r\n                                                        The easy availability of automated\r\n                                                          exploitation tools makes fixing\r\n                                                        high- and critical-risk vulnerabilities\r\n                                                              urgent when discovered.\r\n\r\n\r\n   High-Risk                              Percentage of                  Critical-Risk                          Percentage of\r\n                                          Vulnerability in                                                      Vulnerability in\r\n   Vulnerability                          Total Test Targets             Vulnerability                          Total Test Targets\r\n\r\n   Reflected, Stored, or DOM-Based        28%                            SQL Injection                          2%\r\n   Cross-Site Scripting                                                  Blind SQL Injection                    1%\r\n   Improper Restriction of Excessive      6%\r\n   Authentication Attempts\r\n   Vertical Privilege Escalation          6%\r\n   Missing Authentication                 2%\r\n   HTTPS Not Enabled                      2%\r\n\r\n         Table 1: Top High-Risk Vulnerabilities Found                          Table 2: Top Critical-Risk Vulnerabilities Found\r\n\r\n\r\n\r\nVulnerabilities Breakdown by the 2021 OWASP Top 10\r\nThe Open Web Application Security Project (better known as OWASP) Top 10 list represents a consensus among a large\r\nsampling of developers and web application security teams on the most critical security risks to web applications. In late 2021,\r\nthe Top 10 list was updated for the first time since 2017, with three new categories added and others consolidated or with name\r\nand scope changes.\r\n\r\nWhile intended by OWASP as an awareness document, many organizations use the list as a de facto application security\r\nstandard. It’s interesting to see how the tests conducted by Synopsys correlate with the OWASP Top 10.\r\n\r\nOf the total 28,501 vulnerabilities discovered in the tests, 21,810—76%—fell into a 2021 OWASP Top 10 category. Table 3 lists\r\nthe 10 most prevalent vulnerabilities Synopsys found, matched against five of the OWASP Top 10 categories. If the list had been\r\nextended further, all 10 of the OWASP categories would have been represented. For example, Vulnerable Third-Party Libraries\r\nin Use, which was found in 18% of the pen tests, correlates with the 2021 OWASP Top 10 category A06:2021—Vulnerable and\r\nOutdated Components.\r\n\r\n\r\n\r\n                                                                                                                      | synopsys.com | 5\r\n\f                                                                                                     Percentage of\r\n                                                                                                     Vulnerability in Total\r\n    Description                                  OWASP Top 10: 2021 Category                         Vulnerabilities Found\r\n    Information Disclosure: Information          A01:2021—Broken Access Control                      19%\r\n    Leakage\r\n    Server Misconfiguration                      A05:2021—Security Misconfiguration                  18%\r\n    Insufficient Transport Layer Protection      A02:2021—Cryptographic Failures                     8%\r\n    Authorization: Insufficient Authorization    A07:2021—Identification and Authentication          7%\r\n                                                 Failures\r\n    Application Privacy Tests                    A07:2021—Identification and Authentication          6%\r\n                                                 Failures\r\n    Client-Side Attacks: Content Spoofing        A03:2021—Injection                                  5%\r\n    Fingerprinting                               A07:2021—Identification and Authentication          4%\r\n                                                 Failures\r\n    Authentication: Insufficient                 A07:2021—Identification and Authentication          4%\r\n    Authentication                               Failures\r\n    Application Misconfiguration                 A05:2021—Security Misconfiguration                  3%\r\n    Client-Side Attacks: Cross-Site Scripting    A03:2021—Injection                                  2%\r\n\r\n\r\n                            Table 3: Vulnerabilities Matched Against 2021 OWASP Top 10 Categories\r\n\r\n\r\nA01:2021—Broken Access Control\r\nNineteen percent of the total vulnerabilities were related to the OWASP A01:2021—Broken Access Control category, which moved\r\nfrom the fifth to first listing in the 2021 OWASP Top 10. The OWASP team noted more occurrences of vulnerabilities that fit into\r\nthis category in the applications tested than any other category. Notable CWEs included in this category are CWE-200: Exposure\r\nof Sensitive Information to an Unauthorized Actor, CWE-201: Exposure of Sensitive Information Through Sent Data, and CWE-\r\n352: Cross-Site Request Forgery.\r\n\r\n\r\n\r\n\r\n                                                Many of the vulnerabilities contained\r\n                                                in the Broken Access Control\r\n                                                category cannot be easily detected by\r\n                                                automated testing tools.\r\n\r\nIt’s worth noting that many of the vulnerabilities contained in the Broken Access Control category are more failures in business\r\nlogic than actual vulnerability types, and they cannot be easily detected by automated testing tools. For example, IDOR issues,\r\nwhich allow attackers to manipulate references in order to gain access to unauthorized data, are included in this group. As\r\nmentioned previously, the only effective way to detect IDOR issues is by having a human perform a manual test.\r\n\r\n\r\n\r\n        Of the total 28,501 vulnerabilities discovered in the tests,\r\n          21,810—76%—fell into an OWASP Top 10 category.\r\n\r\n\r\n                                                                                                                  | synopsys.com | 6\r\n\fA02:2021—Cryptographic Failures\r\nEight percent of the total vulnerabilities uncovered in the tests related to the second category in the new OWASP Top 10,\r\nA02:2021—Cryptographic Failures, previously known as Sensitive Data Exposure.\r\n\r\nThis renamed category has moved up one position, from third to second, in the 2021 OWASP Top 10. The OWASP team\r\ndescribes the category as “more of a broad symptom than a root cause,” as these vulnerabilities focus on failures related to\r\ncryptography, which can often lead to exposure of sensitive data. Notable CWEs included in this category are CWE-259: Use of\r\nHard-Coded Password, CWE-327: Broken or Risky Crypto Algorithm, and CWE-331: Insufficient Entropy.\r\n\r\n\r\n\r\n\r\n When combined in the OWASP A05:2021—\r\n     Security Misconfiguration category,\r\n  application and server misconfigurations\r\nrepresented 21% of the overall vulnerabilities.\r\n\r\n\r\nA03:2021—Injection\r\nThe A03:2021—Injection category, now third in the 2021 OWASP Top 10, includes well-known vulnerabilities such as CWE-79:\r\nCross-Site Scripting, CWE-89: SQL Injection, and CWE-73: External Control of File Name or Path. Seven percent of the total\r\nvulnerabilities found in the tests fell into this category.\r\n\r\nA05:2021—Security Misconfiguration\r\nWhen combined in the OWASP A05:2021—Security Misconfiguration category, application and server misconfigurations\r\nrepresented 21% of the overall vulnerabilities found in the tests. The OWASP team notes, “with more shifts into highly\r\nconfigurable software, it’s not surprising to see this category move up” from sixth to fifth position in the OWASP Top 10. Notable\r\nCWEs included in this category are CWE-16 Configuration and CWE-611 Improper Restriction of XML External Entity Reference.\r\n\r\nA07:2021—Identification and Authentication Failures\r\nPreviously known as Broken Authentication, the A07:2021—Identification and Authentication Failures category slid to seventh\r\nposition in the OWASP Top 10 and now includes CWEs related to identification failures.\r\n\r\nTwenty-one percent of the total vulnerabilities found in the tests belonged to this category, including what is identified in the\r\ntests as “fingerprinting,” a security measure sometimes used to authenticate users. However, unless web servers are properly\r\nconfigured and monitored, fingerprinting can also provide attackers with valuable information such as OS type, OS version,\r\nSNMP information, domain names, network blocks, VPN points, and more.\r\n\r\n\r\nTypes of Tests\r\nSixty-seven percent of the tests performed were penetration             Test Type                             Percentage of\r\n                                                                                                              Total Tests\r\ntests—simulated attacks designed to evaluate the security of\r\nan application or system. Pen testing enables organizations             Pen Testing                           67%\r\nto find and fix runtime vulnerabilities in the final development        Dynamic Analysis                      16%\r\nstages of software or after its deployment. Pen tests are often         Mobile                                12%\r\na compliance requirement of security standards. For example,\r\n                                                                        Static Analysis                       2%\r\nthe Payment Card Industry Data Security Standard (PCI DSS)\r\n                                                                        Network Security                      2%\r\nrequires penetration testing on a regular schedule or after any\r\nsignificant changes to the software or system.                          Other                                 0.1%\r\n\r\n                                                                                   Table 4: Types of Tests Performed\r\n\r\n\r\n\r\n                                                                                                                     | synopsys.com | 7\r\n\fDynamic application security testing (DAST) and mobile application–specific tests comprised 16% and 12% of the total tests\r\nrespectively. DAST is used to identify common coding weaknesses such as vulnerability to SQL injection, cross-site scripting,\r\nsecurity misconfigurations, and other common issues detailed in the OWASP Top 10 and the CWE/SANS Top 25.\r\n\r\n\r\n\r\n\r\n                                                                       Synopsys DAST assessments\r\n                                                                         include manual testing to\r\n                                                                        uncover vulnerabilities that\r\n                                                                         typically can’t be found by\r\n                                                                            out-of-the-box tools.\r\n\r\nSynopsys DAST assessments include manual testing to uncover vulnerabilities that typically can’t be found by out-of-the-box\r\ntools, such as some vulnerabilities pertaining to authentication and session management, access control, and information\r\nleakage.\r\n\r\nMobile application security testing (MAST) is used to uncover authentication and authorization issues, client-side trust issues,\r\nmisconfigured security controls, cross-platform development framework issues, and vulnerabilities in application binaries\r\nrunning on the mobile device and corresponding server-side functionality.\r\n\r\n\r\n\r\n\r\n                                                                                                    Percentage of\r\n                                                                             Number of              Vulnerability in\r\n       Vulnerability                                                         Vulnerabilities        Total Pen Tests\r\n       Missing Content-Security-Policy Header                                952                    50%\r\n       Verbose Server Banner                                                 861                    45%\r\n       HTTP Strict Transport Security (HSTS) Not Implemented                 736                    39%\r\n       Weak SSL/TLS Configuration                                            725                    38%\r\n       Cacheable HTTPS Content                                               633                    33%\r\n       Reflected, Stored, or DOM-Based Cross-Site Scripting                  531                    28%\r\n       Weak Password Policy                                                  500                    26%\r\n       Insecure Content-Security-Policy Header                               466                    24%\r\n       Query String Parameter in HTTPS Request                               457                    24%\r\n       Clickjacking                                                          408                    21%\r\n       Excessive Session Timeout Duration                                    371                    19%\r\n       TLSv1.0 Supported                                                     355                    19%\r\n       Unrestricted File Upload                                              347                    18%\r\n       Vulnerable Third-Party Libraries in Use                               336                    18%\r\n       Verbose Error Messages (with Stack Trace)                             331                    17%\r\n\r\n\r\n\r\n                                          Table 5: Top Vulnerabilities Found in Pen Tests\r\n\r\n\r\n\r\n\r\n                                                                                                                   | synopsys.com | 8\r\n\f                                                                                               Percentage of\r\n                                                                        Number of              Vulnerability in Total\r\n    Vulnerability                                                       Vulnerabilities        DAST Tests\r\n    Missing Content-Security-Policy Header                              388                    63%\r\n    HTTP Strict Transport Security (HSTS) Not Implemented               307                    50%\r\n    Verbose Server Banner                                               305                    49%\r\n    Cacheable HTTPS Content                                             242                    39%\r\n    Excessive Session Timeout Duration                                  197                    32%\r\n    Clickjacking                                                        191                    31%\r\n    TLSv1.0 Supported                                                   179                    29%\r\n    Weak SSL/TLS Configuration                                          162                    26%\r\n    Reflected, Stored, or DOM-Based Cross-Site Scripting                162                    26%\r\n    Insecure Content-Security-Policy Header                             158                    26%\r\n    Weak Password Policy                                                157                    25%\r\n    Password Reset Username Enumeration                                 131                    21%\r\n    Secure Cookie Attribute Not Set                                     130                    21%\r\n    Unrestricted File Upload                                            127                    21%\r\n    Unmasked NPI Data                                                   123                    20%\r\n\r\n\r\n                                      Table 6: Top Vulnerabilities Found in DAST Tests\r\n\r\n\r\nTop Vulnerabilities Found in Mobile Tests Matched Against OWASP Risks\r\n\r\n\r\n                                                                                                Percentage of\r\n                                                                                                Vulnerability in\r\n    Vulnerability                                                OWASP Risk Category            Total Mobile Tests\r\n    Lack of Binary Obfuscation                                   M8: Code Tampering             30%\r\n    Application Allows Sensitive Data to Be Copied               M2: Insecure Data Storage      24%\r\n    Application Screenshot Information Disclosure                M4: Insecure Authentication    21%\r\n    Insecure configuration of Application Transport Security     M3: Insecure Communication     20%\r\n    (iOS)\r\n    Lack of Certificate Pinning                                  M3: Insecure Communication     19%\r\n    Sensitive Data Stored Unencrypted in Local Storage           M4: Insecure Authentication    18%\r\n    No Jailbreak Detection                                       M8: Code Tampering             16%\r\n    Sensitive Data Logged to System Logs                         A09:2021—Security Logging      15%\r\n                                                                 and Monitoring Failures\r\n    Weak SSL/TLS Configuration                                   M3: Insecure Communication     14%\r\n    Jailbreak Detection Bypass                                   M8: Code Tampering             14%\r\n    Verbose Server Banner                                        A05:2021—Security              14%\r\n                                                                 Misconfiguration\r\n    No Root Detection                                            M8: Code Tampering             13%\r\n\r\n\r\n                    Table 7: Top Vulnerabilities Found in Mobile Tests Matched Against OWASP Risks\r\n\r\n\r\n\r\n\r\n                                                                                                             | synopsys.com | 9\r\n\fAlthough not as well-publicized as its overall Top 10 list, OWASP also publishes a mobile risks list, last updated in 2016. Table 7\r\nmatches the mobile test findings against the OWASP Top 10 Mobile Risks list of 2016. Two of the vulnerability categories listed\r\nare server-side issues, and they are shown with the comparable 2021 OWASP Top 10 list categories.\r\n\r\n\r\n                        Insecure Data Storage\r\n                        Twenty-four percent of the discovered vulnerabilities in the mobile tests were related to OWASP M2:\r\n                        Insecure Data Storage. These vulnerabilities could allow an attacker to gain access to a mobile device\r\n                        either physically (i.e., accessing a stolen device) or through malware.\r\n\r\n\r\n                        Insecure Communications\r\n\r\n                        Fifty-three percent of the mobile tests uncovered vulnerabilities associated with insecure\r\n                        communications. General best practices include using certificates signed by a trusted provider and\r\n                        ensuring that application transport security is enabled for iOS devices.\r\n\r\n\r\n                        Code Tampering\r\n 0110001101101111\r\n 0110010001100101       A lack of binary protection can result in a mobile app that can be quickly analyzed, reverse-engineered,\r\n 0010000001110100\r\n 0110000101101101       and modified by an adversary. This vulnerability was found in 30% of the mobile tests. Other\r\n 0111000001100101\r\n 0111001001101001       vulnerabilities falling into this category include No Jailbreak Detection, Jailbreak Detection Bypass, and\r\n 0110111001100111       No Root Detection.\r\n\r\n                        Server Security Misconfigurations and Security Logging and Monitoring Failures\r\n                        Verbose server banners—found in 14% of the mobile tests—provide information such as server name,\r\n                        type, and version number; this information could allow attackers to perform targeted attacks on specific\r\n                        technology stacks. The Security Logging and Monitoring Failures category encompasses insufficient\r\n                        logging, detection, and monitoring. Issues related to this category were found in 15% of the tests.\r\n\r\n\r\n\r\nConclusion and Key Takeaways\r\n\r\n                                                                                                     Percentage of\r\n                                                                           Number of                 Vulnerability in Total\r\n     Vulnerability                                                         Vulnerabilities           Test Targets\r\n     Missing Content-Security-Policy Header                                1,347                     52%\r\n     Verbose Server Banner                                                 1,263                     49%\r\n     HTTP Strict Transport Security (HSTS) Not Implemented                 1,108                     43%\r\n     Weak SSL/TLS Configuration                                            1,002                     39%\r\n     Cacheable HTTPS Content                                               918                       36%\r\n     Reflected, Stored, or DOM-Based Cross-Site Scripting                  723                       28%\r\n     Weak Password Policy                                                  717                       28%\r\n     Insecure Content-Security-Policy Header                               632                       25%\r\n     Query String Parameter in HTTPS Request                               610                       24%\r\n     Clickjacking                                                          608                       24%\r\n\r\n\r\n                                               Table 8: Top 10 Vulnerabilities Found\r\n\r\n\r\n\r\n\r\n                                                                                                                  | synopsys.com | 10\r\n\fTesting with a Full Spectrum of Security Tools\r\nAs noted earlier in this report, many organizations use third-party application security testing services to validate their own\r\ntesting, ensure that their internal security controls are working, comply with regulatory or business requirements that mandate a\r\nthird-party assessment, or extend their own software security activities without having to add more staff or new tools.\r\n\r\nThe findings detailed in Table 8 indicate that the majority of development teams had probably conducted their own transparent\r\nbox security testing—such as static analysis—earlier in the software development life cycle and addressed many vulnerabilities\r\nbefore having Synopsys examine the running applications/systems with dynamic analysis, mobile, and penetration tests. It’s\r\nalso clear from the results that the best approach to security testing is to use a spectrum of the tools available to help ensure an\r\napplication or system is secure.\r\n\r\nFor example, 28% of total test targets had some exposure to a cross-site scripting attack, one of the most prevalent and\r\ndestructive high-/critical-risk vulnerabilities impacting web applications. While SAST testing can detect many common\r\nvulnerabilities, it is limited to discovering vulnerabilities that occur in the code itself. Many XSS vulnerabilities occur only when the\r\napplication is running.\r\n\r\nEven Lower-Risk Vulnerabilities Can Be Exploited to Facilitate Attacks\r\nSixty-four percent of the vulnerabilities the tests discovered are considered minimal-, low-, or medium-risk. That is, the issues\r\nfound are not directly exploitable by attackers to gain access to systems or sensitive data. Nonetheless, surfacing these\r\nvulnerabilities is not an empty exercise, as even lower-risk vulnerabilities can be exploited to facilitate attacks. For example,\r\nverbose server banners—found in 49% of the tests—provide information such as server name, type, and version number that\r\ncould allow attackers to perform targeted attacks on specific technology stacks.\r\n\r\n\r\n\r\n                                                The prevalence of cross-site scripting,\r\n                                                clickjacking, and cross-site leak exploits\r\n                                                 makes a strong argument for having a secure\r\n                                                  content security policy to protect against\r\n                                                   various types of attacks, especially cross-\r\n                                                    site scripting.\r\n\r\nImplementing or securing protections such as a content security policy (CSP) can provide an added layer of security that helps\r\ndetect and mitigate certain types of attacks, including cross-site scripting and data injection attacks. An insecure or absent\r\nCSP—which was found (or, more accurately, not found) in 77% of the tests—may be considered a low-risk concern. However, the\r\nprevalence of cross-site scripting, clickjacking, and cross-site leak exploits makes a strong argument for having a secure CSP as\r\nan effective second layer of protection against various types of attacks, especially cross-site scripting.\r\n\r\nAn Urgent Need for a Software Bill of Materials\r\nAs shown in Tables 5 and 6, the pen and dynamic analysis tests found essentially the same types of vulnerabilities, with some\r\nvariation in percentages found. However, of note is the number of Vulnerable Third-Party Libraries in Use, found in 18% of the\r\npen tests. Although not detailed in this report, the same vulnerability was found in 33% of the static analysis tests Synopsys\r\napplication testing services conducted in 2020.\r\n\r\n\r\n\r\n\r\n                                    Highlight from Table 5: Top Vulnerabilities Found in Pen Tests\r\n\r\n\r\n\r\n                                                                                                                      | synopsys.com | 11\r\n\fThe vulnerability description correlates with the 2021 OWASP Top 10 category A06:2021—Vulnerable and Outdated Components.\r\nAs OWASP notes, your software is likely vulnerable if\r\n\r\n• You do not know the versions of all components you use (both client-side and server-side). This includes components you\r\n  directly use as well as nested dependencies.\r\n• The code being used is unsupported or out-of-date. This includes the OS, web/application server, database management\r\n  system, applications, APIs, and all components, runtime environments, and libraries.\r\n\r\nAs the old security saw goes, “you can’t fix problems you don’t know you have.” Most organizations typically use a mix of custom-\r\nbuilt code, commercial off-the-shelf code, and open source components to create the software they sell or use internally. Often\r\nthose organizations have informal—or no—inventories detailing exactly what components their software is using, as well as\r\nthose components’ licenses, versions, and patch status. With many companies having hundreds of applications or software\r\nsystems in use, each themselves likely having hundreds to thousands of different third-party and open source components, an\r\naccurate, up-to-date software Bill of Materials (SBOM) is urgently needed to effectively track those components.\r\n\r\nThe concept of SBOM comes from manufacturing, where the classic BOM is an inventory detailing the items included in a\r\nproduct. When a defective part is discovered, the manufacturer knows precisely what product is affected and can begin the\r\nprocess of repair or replacement.\r\n\r\n\r\n\r\n\r\n                                            BSIMM12 data indicates a 61%\r\n                                            increase in the “identify open source”\r\n           61%                              activity over the past two years, due\r\n            increase                        to the prevalence of open source\r\n                                            components in modern software.\r\n\r\nSimilarly, more and more organizations are working to maintain an accurate, up-to-date SBOM that includes an inventory of\r\nthird-party and open source components to ensure their code is high-quality, compliant, and secure. For example, BSIMM12\r\ndata indicates a 61% increase in the “identify open source” activity over the past two years, due to the prevalence of open source\r\ncomponents in modern software and the rise of attacks using popular open projects as vectors.\r\n\r\nAnd the demand for SBOMs continues to grow. In its 2020 Magic Quadrant for Application Security Testing, Gartner predicted,\r\n“By 2024, the provision of a detailed, regularly updated software Bill of Materials by software vendors will be a non-negotiable\r\nrequirement for at least half of enterprise software buyers, up from less than 5% in 2019.”\r\n\r\nAnd while the 2021 executive order on Improving the Nation’s Cybersecurity is primarily directed at federal departments,\r\nagencies, and contractors, its requirement for third parties to provide government software purchasers with a comprehensive\r\nSBOM will likely have a broad impact across critical infrastructure sectors and related technology suppliers.\r\n\r\n\r\nAbout CyRC Research\r\nThe mission of the Synopsys Cybersecurity Research Center (CyRC) is to publish security research\r\nthat helps organizations better develop and consume secure, high-quality software. Our recent\r\nsecurity and software quality reports include the “Open Source Security and Risk Analysis” (OSSRA)\r\nreport, and “Peril in a Pandemic: The State of Mobile Application Security.”\r\n\r\n\r\n\r\n\r\n                                                                                                            CyRC\r\n                                                                                                                 | synopsys.com | 12\r\n\fThe Synopsys difference\r\n\r\n\r\nSynopsys provides integrated solutions that transform the way you build and deliver software,\r\naccelerating innovation while addressing business risk. Our unmatched expertise helps you\r\nplan and execute any security initiative. We offer the most comprehensive product portfolio in\r\nthe market, and it interoperates with third-party and open source tools. This open, pragmatic\r\napproach empowers your organization to leverage existing investments in testing tools to\r\nbuild the security program that best meets your needs. With Synopsys, your developers can\r\nsecure code as fast as they write it. Your development and DevSecOps teams can automate\r\ntesting within development pipelines without compromising velocity. And your security teams\r\ncan proactively manage risk and focus remediation efforts on what matters most to your\r\norganization. Only Synopsys offers everything you need to build trust in your software.\r\n\r\n\r\nFor more information, go to www.synopsys.com/software.\r\n\r\nSynopsys, Inc.\r\n690 E Middlefield Road\r\nMountain View, CA 94043 USA\r\n\r\nContact us:\r\nU.S. Sales: 800.873.8193\r\nInternational Sales: +1 415.321.5237\r\nEmail: sig-info@synopsys.com\r\n\r\n\r\n\r\n\r\n©2021 Synopsys, Inc. All rights reserved. Synopsys is a trademark of Synopsys, Inc. in the United States and other countries. A list of Synopsys trademarks is available at\r\nwww.synopsys.com/copyright.html . All other names mentioned herein are trademarks or registered trademarks of their respective owners. December 2021\r\n\r\n\r\n\r\n\r\n                                                                                                                                                      | synopsys.com | 13"
  }
}